[
  "NATO OTAN\nMIP\nMultilateral Interoperability ProgrammeTHE JOINT C3 INFORMATION EXCHANGE DATA MODEL OVERVIEW Date and location of approval: 16 February 2007, Greding Germany This document has been reviewed and is hereby “Approved” by the respective management authorities of the MIP-NATO Management Board (MNMB). The information contained herein remains the property of the MNMB; as such, its release to nations or agencies, who are not themselves participants in the Multilateral Interoperability Programme, including the media and general public, is agreed; however, unauthorised amendment of the information is not permitted. Use of the information contained within the body of the document is entirely at the user’s risk. Furthermore, if information contained within this document is used, appropriate acknowledgement to the MNMB should be made. ",
  "JC3IEDM OVERVIEW – UK – DMWG 16 February 2007 Edition 3.1a CONTENTS PREFACE . . vi Purpose .. . xi 1. INTRODUCTION .. 1.1 Evolution of the Joint C3 Information Exchange Data Model (JC3IEDM) ... .. 1   \n1.2 Purpose of JC3IEDM Documentation. .. 4   \n1.3 Scope .. . 4   \n1.4 Structure of This Document . . 4 2. OVERVIEW OF REQUIREMENTS . 5 2.1 Introduction . . 5   \n2.2 General Requirements in ATCCIS Phase III. . 5   \n2.3 Fire Support Requirements. . 7   \n2.4 Requirements in Phase IV . . 8   \n2.5 Requirements during ATCCIS 2000 (Phase V) . . 16   \n2.6 MIP Block 1 Work . . 18   \n2.7 MIP Block 2 Work . . 18   \n2.8 MIP Block 3 Work . . 18 3. OVERVIEW OF THE DATA MODEL . . 19 3.1 Concepts Underlying the Design of the Data Model. . 19   \n3.2 Guide to Contents ... .. 20   \n3.3 Foundational Structural Elements . . 21   \n3.4 OBJECT-TYPE Hierarchy . . 26   \n3.5 Composition of Types (Establishment) .. 27   \n3.6 OBJECT-ITEM Hierarchy . .. 29   \n3.7 Specifying Status of OBJECT-ITEMs . . 31   \n3.8 Specifying Access to OBJECT-ITEMs . .. 33   \n3.9 Associations between OBJECT-ITEMs .. .. 34   \n3.10 Capabilities of Items and Types . . 37   \n3.11 Positioning and Geometry for OBJECT-ITEMs . . 39   \n3.12 Relationships between Items and Types.. .. 42   \n3.13 Plans and Orders.. .. 45   \n3.14 ACTION: Structured Specification of Activity. .. 47   \n3.15 Broadening Functionality of ACTION. . 50   \n3.16 Data about Reported Data . .. 58   \n3.17 Applying Security Classifications . . 60   \n3.18 Citing External Information Sources.. . 60   \n3.19 CONTEXT as a Way of Grouping Data.. . 61   \n3.20 Attaching Affiliation to Items and Types . . 64 ",
  "JC3IEDM OVERVIEW – UK – DMWG 16 February 2007 Edition 3.1a   \n3.21 Counting Persons by Group Characteristics. . 66   \n3.22 Summary of JC3IEDM Features . . 68   \n3.23 Examples of Potential Use . . 69 iii ",
  "JC3IEDM OVERVIEW – UK – DMWG 16 February 2007 Edition 3.1a LIST OF FIGURES Figure 1. C2 Data in Relation to Functional Areas. .. 3   \nFigure 2. Independent Entities for Creating the Data Specification . .. 24   \nFigure 3. First Level Subtyping of OBJECT-TYPE and OBJECT-ITEM.. .. 25   \nFigure 4. Entity-Level View of OBJECT-TYPE Subtype Tree.. .. 26   \nFigure 5. Specifying Establishments.. .. 28   \nFigure 6. Assigning Establishment to OBJECT-ITEM. .. 29   \nFigure 7. Entity-Level View of OBJECT-ITEM Subtype Tree. . 30   \nFigure 8. Specifying Hostility Status . .. 32   \nFigure 9. Specifying Status of OBJECT-ITEMs. .. 33   \nFigure 10. Providing Access to an OBJECT-ITEM through ADDRESS. ... 34   \nFigure 11. Associations among OBJECT-ITEMs.. .. 35   \nFigure 12. Specifying Organisational Structure... .. 37   \nFigure 13. Specifying Capabilities of Objects . .. 38   \nFigure 14. Entity-Level View of the LOCATION Structure .. .. 40   \nFigure 15. Assigning Position and Geometry to OBJECT-ITEMs.. ... 42   \nFigure 16. Assigning Type Classification to an OBJECT-ITEM . ... 43   \nFigure 17. Accounting for Holdings by an OBJECT-ITEM. ... 44   \nFigure 18. Assigning Reporting Codes to MATERIEL-TYPE . ... 44   \nFigure 19. Plans and Orders Structure Shown at Entity Level .. 45   \nFigure 20. Basic ACTION Structure. ... 47   \nFigure 21. An Example of ACTION Hierarchy. .. 48   \nFigure 22. ACTION Subtype Structure . .. 50   \nFigure 23. TARGET Structure... ... 51   \nFigure 24. REQUEST Structure.. ... 52   \nFigure 25. ACTION-RESOURCE-EMPLOYMENT Structure ...... ... 54   \nFigure 26. RULE-OF-ENGAGEMENT Structure.. .. 55   \nFigure 27. Candidate Target Structure.. .. 56   \nFigure 28. Linking Candidate Targets to Operations Planning.. .. 57   \nFigure 29. Structure for REPORTING-DATA . .. 59   \nFigure 30. Relationships from SECURITY-CLASSIFICATION . ... 60   \nFigure 31. REFERENCE and Its Relationships. ... 61   \nFigure 32. Basic CONTEXT Structure .. ... 62   \nFigure 33. CONTEXT Associations . ... 63   \nFigure 34. Assessments of CONTEXTs . .. 64   \nFigure 35. Structure for Specifying Affiliations . .. 65   \nFigure 36. Structure for Counting PERSON-TYPEs. ... 66   \nFigure 37. High-Level View of JC3IEDM . ... 68 ",
  "LIST OF TABLES Table 1. Evolution to JC3IEDM. . 2   \nTable 2. Summary of Information Requirements . 5   \nTable 3. Categories of Operational Information . .. 6   \nTable 4. Initial Minimum Set of Essential IERs .. .. 9   \nTable 5. Capsule Descriptions of Phase IV IERs . 10   \nTable 6. Article V Requirements and Fulfillment in the Model . . 14   \nTable 7. CRO Requirements and Fulfillment in the Model.. . 16   \nTable 8. Joint Requirements and Fulfillment in the Model . . 17   \nTable 9. Independent Entities and Their Roles. . 22   \nTable 10. Definition of First-Level Subtypes . .. 25   \nTable 11. Permissible Combinations of Types for Establishments .. 29   \nTable 12. Valid OBJECT-ITEM Associations . .. 36   \nTable 13. Examples of Associations.. .. 36 ",
  "PREFACE THE JOINT C3 INFORMATION EXCHANGE DATA MODEL OVERVIEW Introduction The application of military force in the early $2 1 ^ { \\mathrm { s t } }$ century is demanding. It covers a wide spectrum of threats and deployment scenarios that range from conventional general war through to limited operations, crisis response operations, asymmetric conflict, and terrorism. Unilateral capability is important to nations but most planning is made on the assumption of alliance and coalition operations in scenarios that are difficult to predict and which often arise at short notice. Thus the nature and composition of a force structure to meet military requirements will be specific to requirement and based upon a general and flexible military capability. To achieve this, an assured capability for interoperability of information is essential. The successful execution of fast moving operations needs an accelerated decision-action cycle, increased tempo of operations, and the ability to conduct operations within combined joint formations. Commanders require timely and accurate information. Also, supporting command and control (C2) systems need to pass information within and across national and language boundaries. Moreover, tactical C2 information must be provided to the operational and strategic levels of command including other governmental departments. Additionally, forces must interact with non-governmental organisations, including international aid organisations. The Multilateral Interoperability Programme (MIP) aims to deliver an assured capability for interoperability of information to support joint / combined operations. Multilateral Interoperability Programme (MIP) The aim of the Multilateral Interoperability Programme (MIP) is to achieve international interoperability of Command and Control Information Systems (C2IS) at all levels from corps to battalion, or lowest appropriate level, in order to support multinational (including NATO), combined and joint operations and the advancement of digitization in the international arena. The means to achieve this is known as the MIP solution. This is a set of items delivered by the MIP programme at the end of each baseline1. It includes the MIP specifications, Standard Operating Procedures and other documentation that is required for implementation of specifications and for use of the MIP Common Interface (MCI)2 . The MIP Concept ",
  "The MIP solution enables information exchange between co-operating but distinct national C2 systems. It is not within the scope of the programme to specify the C2IS end system functional capabilities; however, the MIP solution has proven to be a valuable source for national C2IS development. Key to this is the fact that national systems need not necessarily conform to any hardware or software standard. Typically, systems will be acquired through national or NATO acquisition programmes and their architecture will conform to the national or NATO policy prevailing at the time. The core of a MIP Baseline solution is the Information Exchange Data Model. It is a product of the analysis of a wide spectrum of Allied information exchange requirements. It models the information that combined joint component commanders need to exchange. The MIP solution enables C2IS to C2IS information exchange and allows users to decide what information is exchanged, to whom it flows, and when. The concept for the overall end state is such that when the combined joint force can operate as a single, synchronised team in accomplishing its assigned mission in the modern battle space, MIP will have achieved its target. In order to achieve that synergy, shared situational awareness between commanders within a combined joint force conducting military operations is required. The MIP contribution to this end state is to facilitate the timely flow of accurate and relevant information, using the Information Exchange Mechanisms (IEMs) specified by MIP, between the different national C2IS. MIP will, therefore, be one of the factors contributing to the realization of NEC (Network Enable Capabilty) for the commanders within a combined joint force. MIP Baseline 1, which was in-service during 2004-05, comprises: The Land C2 Information Exchange Data Model (LC2IEDM).   \nThe Message Exchange Mechanism (MEM) consists of a suite of formatted messages that conform to AdatP-3 Part 1, plus guidelines for their use.   \nThe Data Exchange Mechanism (DEM) is an automatic data push mechanism that coexists with the MEM. When a C2 application changes the state of information that it holds, and which is recognised by the DEM, this information is automatically replicated to all other co-operating C2 systems that have agreed to exchange this information. With both exchange mechanisms the meaning and context of the information is preserved and requires no additional processing on receipt to make it useful. The MIP specifications enable interoperability at Degree $4 . \\mathrm { { a } } ^ { 3 }$ (DEM) and $2 . \\mathrm { h ^ { 4 } }$ (MEM) and functions at NATO Level 5 of System Interconnection5. ",
  "The MIP Baseline 2, which is scheduled to be in-service 2006-08, evolves the LC2IEDM into the C2IEDM and uses an improved version of the DEM for data replication. The improvements are based on the use of the latest version of the DEM (Baseline 1), the reduction of bandwidth requirements, the use of more granular information exchange contracts, in a way similar to Block 1 MEM messages, and by prioritising information flow. The MEM is used for writer-to-reader messages only (not for data replication). The MIP Baseline 3 will expand and evolve the C2IEDM into the JC3IEDM by including and modelling new joint Information Exchange Requirements (IERs). The NATO Data Administration Group (NDAG) is the partner of MIP in this effort by virtue of the Memorandum of Agreement (MoA) signed in 2004 for such a purpose. The JC3IEDM is also the NATO STANAG 5525. The DEM will evolve also to better suit the operational information exchange needs and the MEM will be used in same way than Baseline 2. In future Baselines, the MIP solution will be expanded to extend the panoply of interoperability services provided (Messaging, Web, Directory, Security, collaboration…). The requirements for which have been, and will continue to be, captured in the MTIR (MIP Tactical C2 Interoperability Requirements), which forms the road map for the future, to allow a graduated incorporation of improvements into subsequent baselines. Development of the programme is based on a cyclical process of operational analysis, concept, feasibility, definition, development and demonstration. Whilst previous baselines continue to be sustained, new operational requirements are analysed, new capabilities are agreed, and emerging technologies are explored. The baseline delivered in each cycle will be in-service for the following two years in order to encourage nations to align their acquisition cycles with the agreed implementation schedule to gain maximum benefit. The programme is tightly focused on delivering capability to the warfighter in an incremental manner with the intent to achieve a 2-year delivery cycle. History The Multilateral Interoperability Programme was established by the Project Managers of the Army Command and Control Information Systems (C2IS) of Canada, France, Germany, Italy, the United Kingdom and the United States of America in April 1998 in Calgary, Canada. MIP replaced and enhanced two previous programmes: BIP (Battlefield Interoperability Programme) and QIP (Quadrilateral Interoperability Programme). The aim of these programmes was similar to the present MIP but each was active at a different level of command. In 2002 the Army Tactical Command and Control System (ATCCIS) programme merged with MIP. ATCCIS was founded in 1980 to see if interoperability could be obtained at reduced cost and developed according to technical standards agreed by Nations and prescribed by NATO. The programme sought to identify the minimum set of specifications, to be included within national C2 systems that would allow interoperability between them. With the publication of ATCCIS Baseline 2 the programme’s mandate was complete. By 2002 the activities of ATCCIS and MIP were very close, expertise was shared, and specifications and technology was almost common. The merger of ATCCIS and MIP was a natural and positive step and this was recognised by the almost immediate publication of a NATO policy that endorses MIP6. ",
  "MIP has strong NATO support, reinforced by the signing of a Memorandum of Agreement (MOA) between the MIP and NATO Data Administration Group (NDAG) stating their intent to collaborate data modelling efforts in order to produce a Joint Consultation Command & Control Information Exchange Data Model (JC3IEDM). MIP Organisation The MIP programme is not a formal NATO programme. Rather it is a voluntary and independent activity by the participating nations and organizations. The nations and HQs that are active in the MIP programme are: Australia, Austria, Belgium, Canada, Czech Republic, Denmark, Finland, France, Germany, Greece, Hungary, Italy, Lithuania, Netherlands, Norway, Poland, Portugal, Romania, Slovenia, Spain, Sweden, Turkey, United Kingdom, United States, JFC Brunssum and Allied Command Transformation (ACT). The MIP consists of Full Members7 (nations only) and Associate Members8 (nation and non-nation entities). MIP is organised into 5 working groups with an executive management body (MIP Program Management Group, PMG) and a high level steering group (MIP Steering Group, MSG) for resources, policy and targets. At the working group level, the Multidisciplinary Working Parties (MDWP) with experts from the various Working Groups is the paradigm. Rigour is maintained by the adoption of recognised system engineering practices. In addition to the interface specification and the exchange mechanisms, MIP also produces supporting products covering programme management, security policy, test schedules, configuration management, representative data fills, and international liaison. 7 Full Members are nations that commit to support the collaborative development of succeeding versions of the MIP interoperability solution suitable for fielding. In addition, a Full Member is a Nation that has signed the MIP Statement of Intent (SOI) regarding their participation in MIP and has stated an intention to field the MIP solution. Full Members undertake to be represented in all WGs and must be prepared to expend the resources required to develop and sustain the MIP solution. A Full Member must be involved in and contribute actively to the decision-making process throughout the specification and development cycle. Full Members have voting and access rights at all meetings. 8 Associate Members include nations and non-nation entities, such as military agencies and formations, showing an interest in this programme, that have been granted Associate Member status by the MIP Steering Group (MSG). Associate Members enjoy all the rights and privileges of a Full Member as agreed by the MSG except Associate Members do not have any voting rights at meetings. Associate members need not support all MSG/PMG and WG meetings. In addition, Associate Members accept the MIP Statement of Intent (SOI). ",
  "Organizational structure of the MIP (Multilateral Interoperability Programme) and its interaction with NATO bodies, highlighting the roles of various management groups, working groups, and multidisciplinary working parties.MIP-NDAG Management Board (MNMB) The MNMB is co-chaired by representatives of both MIP and $\\mathrm { N D A G ^ { 9 } }$ and conducts its business in accordance with the MOA10. Recommendations made to the Board must be taken to their parent group for approval (as shown in the above diagram). The Board will perform, in combined NDAG MIP PMG sessions held in conjunction with MIP PMG meetings, strategic data planning consisting of: Approval of IERs from NDAG and MIP to incorporate into future versions of the JC3IEDM.   \n• Prioritising and de-conflicting IERs.   \n• Evolution of the JC3IEDM in accordance with the MIP Integrated Programme Schedule (MIPS).   \n• Approval of the Programme of Work for the evolution of the JC3IEDM.   \n• Resolution of any issue highlighted by either organisation.   \n• Initial approval of the JC3IEDM that both organisations will propose to their parent groups; the (ISSC) and (MSG) for final approval. Implementation, Adoption and Stability The MIP is involved in the following activities and standards: The Land LC2IEDM was the basis for the initial version of NATO Reference Model that was developed to Version 4. In response to NATO/MIP MOA, Version 4 was ",
  "JC3IEDM OVERVIEW – UK – DMWG 16 February 2007 Edition 3.1a merged with C2IEDM Edition 6.1 to result in the current JC3IEDM Edition 3.0. It will constitute the technical content of STANAG 5525 (NATO Standardization Agreement of the IEDM). Implementation of the MIP specification is a NATO Force Goal (EL2802). • NATO Policy on MIP calls for close co-ordination and re-use of the MIP specification within NATO. • Bi-SC (Bi-strategic Commands) Automated Information System will use the MIP solution in its Land Functional Services (Land FS) to interface to national CCIS, either in HRF/FLR, CJTF or other crisis response operation or exercise11. • NATO Standardisation Agreement SO 01-11 calls for the implementation of MIP specifications. The MIP specification is well regarded in the NC3A (NATO Consultation Command and Control Agency). It is the core capability of the NC3A Integrated Data Environment prototype, a capability to integrate legacy systems. • The MIP specification is included in the NATO C3 Technical Architecture. • The NATO Military Criteria for High Readiness Forces (Land) Headquarters requires the use of an ATCCIS12 compliant land information system. • NATO Response Force (NRF) requirements call for the use of a MIP compliant interoperability solution. • Many national C2 information systems implement MIP specifications. Purpose This document provides an Overview of the Joint Command, Control and Consutation Information Exchange Data Model (JC3IEDM). ",
  "(This page intentionally left blank) xii ",
  "1. INTRODUCTION 1.1 Evolution of the Joint C3 Information Exchange Data Model (JC3IEDM) 1.1.1 General 1.1.1.1 Data interoperability requires a rigorously defined semantic vocabulary that is embedded in a structured context. 1.1.1.2 The structure of information is expressed in a data model, built and documented in accordance with an accepted methodology. The model defines the standard elements of information (data) that form the basis for interoperability between those automated Command and Control Information Systems (C2ISs) that accommodate the model's information structure. 1.1.1.3 Since information exchange requirements (IERs) change over time, there is a need to design a flexible generic model that could adapt over time to changing information needs and serve as a basis or hub for new systems. For these reasons the data model was initially known as the Generic Hub (GH) Data Model. The name was changed to Land C2 Information Exchange Data Model (LC2IEDM) in 1999 and an updated version was released in 2002. 1.1.1.4 Development continued to include considerably more joint content. The new version was released in November 2003 as C2 Information Exchange Data Model (C2IEDM) Edition 6.1. Priority operational requirements entailed a modification to the 6.1 specification. A final Block 2 specification was released as Edition 6.15e in October 2005. 1.1.1.5 The current version incorporates additional development and the data from the NATO Corporate Reference Model. As a result, the scope increased and the name was changed to Joint C3 (Command, Control, and Consultation) Information Exchange Data Model (JC3IEDM). The evolution is shown in Table 1. 1.1.1.6 The extent of requirements agreed by the MIP nations is to define only the information that is to be exchanged rather than all of the information that would normally be required by a national system. Consequently, JC3IEDM is first and foremost an information exchange data model. The model can also serve as a coherent basis for other information exchange mechanisms, such as message formats, currently lacking a unified information structure. 1.1.1.7 As a minimum, the JC3IEDM must preserve the meaning and relationships of the information to be exchanged and thereby attain the interoperability associated with NATO Level 5 of System Interconnection (automated exchange of data, with userimposed constraints, between C2IS databases). ",
  "JC3IEDM OVERVIEW – UK – DMWG 16 February 2007 Edition 3.1a A table listing various data models related to ATCCIS Battlefield Generic Hub and C2 Information Exchange Data Models, detailing their short labels, titles, versions, dates of issue, informal names, and producers.1.1.2 Fundamental Information Structure/Data Modelling Concepts 1.1.2.1 Trying to create an information structure that represents all of the information about an arena of operations is an understandably complex task. Data modelling methodologies have adopted several conventions that parallel the military staff processes in many ways. There are three models that are presented in the JC3IEDM, namely the conceptual, logical and physical. 1.1.2.2 Conceptual Data Model. The Conceptual Data Model represents the high level view of the information in terms of generalised concepts such as Actions, Organisations, Materiel, Personnel, Features, Facilities, Locations and the like. This model is of interest to senior commanders wishing to verify the scope of the information structure. The presentation in Chapter 3 may be viewed as conceptual. 1.1.2.3 Logical Data Model. The Logical Data Model represents all of the information and is based upon breaking down the high level concepts into specific information that is regularly used. For example, a tank is an armoured fighting vehicle that is a piece of equipment that is a piece of materiel. This breakdown follows human reasoning patterns and allows command and control systems to generalise by recognising, for instance, that tanks are equipment. A logical data model specifies the way data is structured with an entity-attribute-relationship diagram and supporting documentation. This model should be of interest to staff officers to ensure that the operational information content is complete. Most of the main part of the document as well as a number of annexes focus on logical aspects of the model. ",
  "1.1.2.4 Physical Data Model. Physical Data Model provides the detailed specifications that are necessary to generate a physical schema that defines the structure of a database. It is of primary concern to C2IS system developers building JC3IEDMcompliant systems. The specification of the physical data model is to be found in this paper and in the MIP Information Resource Dictionary (MIRD). 1.1.2.5 Data Modelling Tool. The diagrams for the model are documented in IDEF1X notation. They were created using ERwin™ Version 3.5.2 software from Computer Associates International, Inc. 1.1.3 The Notion of a C2 Data Model as a Hub 1.1.3.1 A C2 data model of necessity must encompass information from multiple functional areas in the domain of military operations. Consequently, a C2 data model serves as a “hub” for unifying information concepts that are embodied in the data specifications of functional areas. The concept of interdependence between the C2 data model and the speciality subjects represented by functional areas is illustrated in Figure 1 below. Combat Operations\n\n- Special Ops\n- Air Support\n- Administration (Personnel)\n- Engineer Operations\n- Air Defense & Airspace Control\n- Intelligence/Electronic Warfare (IEW)\n- Fire Support\n- Communications and Electronics\n- Combat Service Support & Logistics1.1.3.2 The desired goal in the long run would be a federation of data specifications that use the C2 data model as the basis for functional area models. This would ensure that the data that is common between the spokes and the hub is viewed and structured in a standard way and that the data model views can be readily integrated into coherent structures wherever such integration is needed. ",
  "1.1.3.3 Initial evolution of the model included specific inputs from the following functional areas: conventional fire support, barrier engineering operations, communications and electronics, and personnel administration. Operational requirements have been drawn from these as well as other areas, as documented in Chapter 2. 1.2 Purpose of JC3IEDM Documentation The aim is to provide the following: a. A description of the common data in an overall model that contains all relevant data abstracted in a well-structured and normalised way, unambiguously reflecting their semantic meaning.   \nb. A base document that can be used as a reference for future amendments to the model.   \nc. A core upon which nations can base their own modelling efforts of chosen areas and onto which specialised area models can be attached or “hung.”   \nd. A basic document that nations can use to present and validate functional data model views with their own specialist organisations.   \ne. A specification of the physical schema required for database implementation. 1.3 Scope The scope of the analysis carried out in the development of the JC3IEDM is principally directed at producing a corporate view of the data that reflects the multinational military information exchange requirements for multiple echelons in landbased wartime operations and crisis response operations (CRO) to include joint interfaces that support land operations. The data model is focused primarily on the information requirements that support the operations planning and execution activities of a military or civilian headquarters or a command post. 1.4 Structure of This Document 1.4.1 The organisation of the main body of this paper is summarised as follows: a. Introduction (Chapter 1).   \nb. Overview of Requirements (Chapter 2) provides a general statement of requirements that the data specification attempts to meet.   \nc. Overview of the Conceptual Data Model (Chapter 3) provides a general description of design considerations, a brief description of the model concepts in operational terms, and a summary description of the model in technical terms. ",
  "2. OVERVIEW OF REQUIREMENTS 2.1 Introduction The purpose of this chapter is to provide an overview of the information exchange requirements that underpin the model. Detailed view of requirements and their relationship to data specifications may be found in three databases (JC3IEDM CRODatabase-UKDMWG-Edition _.mdb, C3IEDM CJTFDatabase-UK-DMWG-Edition .mdb, and C3IEDM ArticleVDatabase-UK-DMWG-Edition .mdb at URL mip-site.org). 2.2 General Requirements in ATCCIS Phase III 2.2.1 Modelling work was started early in Phase III (in 1992) without a formal statement of information exchange requirements. The Data Subgroup was staffed by a combination of serving military officers and technical experts and acted as its own source of requirements. The extensive military experience provided a good basis for the initial design. The underlying requirements corresponded in general terms to those outlined in Table 2. A table categorizing major topics and their corresponding information categories, including details on forces, environmental conditions (both physical and civil), situational information, and operational context.2.2.2 Table 3 provides further detail. The requirements should be viewed in the context of applicability for the international exchange of information between national C2 elements as well as the potential use of JC3IEDM for exchange of information between C2 elements of multinational formations. ",
  "Table of Categories of Operational Information2.2.3 The Data Subgroup used the above table as general guidance and supplemented it with contributions and suggestions from individual delegates who used various reference documents as sources, including NATO STANAGs and messages, national field manuals and guides for tactical operations, and selected standard operating procedures. A set of general requirements that emerged over a period of time may be described by the following set of statements: ",
  "a. Objects of military significance need to be identified. In this context, “objects” refer to physical things including units, equipment, stores, personnel, facilities, geographic features, and also to non-physical concepts such as coordination points, lines, and areas. Such objects may already exist and be known; they may also be newly identified or expected in the future.   \nb. Individual objects must be distinguished from the classes of objects to which they belong. Many objects are of interest primarily in terms of their class or category rather than as an individual object; for example, tanks, armoured brigades, or infantrymen.   \nc. Objects and their types need to be described with a number of characteristics that are sufficient for supporting command and control tasks. For example, it must be possible to describe the size of a unit, the name of a commanding officer, or the military load classification of a bridge. Such information tends to be dynamic in nature; as new information becomes available other information becomes outdated or nullified.   \nd. An explicit subset of the requirement in paragraph $c$ is the need for information elements associated with objects to permit suitable display of the operational situation.   \ne. Selected information about certain characteristics of objects needs to be retained for a period of time. For example, it must be possible to keep a historical log of the location of a unit for purposes of tracking and to specify predicted future locations of a unit for purposes of planning. Such a time record is also needed for other dynamic characteristics of objects, such as their operational or personnel status and their holdings in terms of other objects (e.g., the number of troops and/or equipment in a particular unit). 2.3 Fire Support Requirements 2.3.1 Requirements were also gleaned from specialised functional areas, such as fire support. Fire support is the collective and coordinated use of indirect fire weapons, armed aircraft, and other lethal and non-lethal means in support of a battle plan. Conventional fire support includes the employment of field artillery, mortars, naval gunfire (NGF), close-in fire support (employment of rotary wing aircraft in a fire support role), and close air support (employment of fixed wing aircraft in a fire support role). 2.3.2 Fire support consists of three essential parts: command and control, target acquisition for intelligence use, and employment of attack resources. These elements constitute a good description of the more general C2 challenge. a. Command and control. A large part of C2 activity consists of synchronisation, which is defined as the arrangement of military actions in time, space, and purpose to produce maximum relative combat power at a decisive point.   \nb. Target acquisition for intelligence use. Target acquisition allows the joint or combined force to detect, identify, and locate targets with sufficient accuracy and timeliness to permit their attack. It is a product of intelligence derived from comparison, corroboration, integration, analysis, and evaluation of information collected by any of the intelligence disciplines such as signals intelligence (SIGINT), human intelligence (HUMINT), and imagery intelligence (IMINT). ",
  "c. Employment of attack resources. The following attack resources may be employed in fire support: mortars, cannon (howitzers and guns), rocket and missile launchers, fixed wing aircraft, rotary wing aircraft, naval gunfire, and electronic warfare. The attack resources can be characterised as lethal or non-lethal. Lethal fire support resources include field artillery and mortars, naval gunfire, and air support. Nonlethal fire support resources include offensive electronic warfare (EW), reflected energy emitters, and smoke and illumination munitions and their delivery systems. 2.3.3 Fire support coordination and direction requires intensive C2 activity. Two interrelated functions account for the complexity and intensity of C2 activities. The first involves technical fire direction and is a specialised function. The second function is the overall C2 process for employing fire support assets in joint or combined operations and has a considerable bearing on the overall C2 process. 2.3.4 NATO has moved toward increased use of multinational and joint forces with their inherent mix of combat capabilities and the integration of attack means, both lethal and non-lethal, provided by air, naval, and artillery fire support. Increased joint employment of forces has fostered the development of joint tactics, techniques, and procedures. The impact on fire support C3 and the attendant needs for information exchange have been substantial. 2.3.5 The types of information to be exchanged in multinational and joint fire support operations are exemplified by the following categories: a. Joint and combined fire support planning, allocation of resources, and commanders' guidance.   \nb. Enemy and situation data including target identification and location information.   \nc. Fire support requests, both pre-planned and immediate, and schedule of fires.   \nd. Friendly force location and scheme of manoeuvre information.   \ne. Joint terminal control actions as provided by a forward air controller, forward observer, gunfire spot team, or laser designation team.   \nf. Coordination and integration of joint use of lethal and non-lethal assets.   \ng. Battle damage assessment information of friendly and enemy fires.   \nh. Ammunition status. 2.4 Requirements in Phase IV 2.4.1 IERs for Phase IV were produced by the newly formed Operational Group at the first meeting17. The initial set selected by the Operational Group is listed in Table 4. IERs are grouped according to staff function under column heading “Domain.” The last column in the table corresponds to the tracking number assigned by the Data Group and is used in a subsequent table. ",
  "A table listing various military domains, their abbreviations, short titles, sources, and corresponding numbers. The domains include G2 (Intelligence), G3 (Operations), G4 (Logistics), G1 (Personnel), Fire Support, Engineer Support, Air Defence, Air OPS, Helicopters, G5 (Civil/Military Operations), and Electronic Warfare. Each domain includes specific reports or orders with detailed abbreviations and descriptions. Sources are primarily from APP9, with some from Stanag 2014.",
  "Table listing various military communication and electronic warfare message types with their abbreviations, short titles, sources, and corresponding numbers under the domain G6.2.4.2 Additional description of the IERs is provided in Table 5 where IER name, abbreviated name, and the source are listed in one row. The purpose of the IER is listed in the next row. This set of IERs is referred to as Article V requirements. Table 5. Capsule Descriptions of Phase IV IERs",
  "A table listing various military information exchange requirements (IERs) with their abbreviated names and references, detailing their purposes such as standardizing methods for disseminating information on reserved demolitions, enemy land forces situations, electronic warfare requests, hostile actions, fire missions, operation orders, helicopter landing sites, intelligence reports, and joint air attack team missions.",
  "A table listing various Intelligence and Reporting formats used in military operations, detailing their abbreviated names and references. Each entry describes the purpose of the report, such as informing command structures about logistics, medical situations, NBC (Nuclear, Biological, Chemical) events, and obstacle reporting. The table includes reports like Land Intelligence Report (LANDINTREP), Logistic Assessment Report (LOGASSESSESSREP), Medical Situation Report (MEDSITREP), and Nuclear Biological and Chemical Report 1 (NBC1), among others, with corresponding APP reference codes for standardized usage.",
  "A table listing various military reports and orders, detailing their abbreviated names and references. Each entry includes a description of the report's purpose, such as standardizing methods for reporting land forces situations, personnel information, presence of units, radio frequency requests, rule of engagement implementations and requests, radio relay frequency requests, scatterable minefield reports, requests, and warnings, operation orders and plans, and weapons control orders. The table also specifies the relevant APP or STANAG reference for each item.2.4.3 Individual IERs from APP-9 cover relatively broad ranges of data since each IER is self-contained as a message. Each IER was parsed by the Data Group into a set of smaller and more manageable pieces that are referred to as Information Content Elements (ICEs) and are stored in the IER/ICE Database. Table 6 lists the IERs. The ICE count for each IER is listed in the column “ICE Grand Total.” The table provides an accounting of the disposition of requirements. The categories are as follows: a. Complete—Data identified in the ICE can be represented in the model or is derivable from the model. Derivable means that the underlying data identified by ICE definition can be accommodated within the model specification, but the specific form of information required by the ICE needs to be extracted at the application level. ",
  "b. Incomplete—Data identified in the ICE cannot be fully represented in the model; modifications to the model may entail addition of domain values, new attributes or new entities.   \nc. Clarification Needed—The ICE definition is either ambiguous or contains references to undefined acronyms or abbreviations that cannot be deciphered by the analysts. The category may also include a question about the ICE as a requirement. A further explanation has been requested from the Operational Group before further work is done.   \nd. Requirement Withdrawn—An initial requirement put forth by the Operational Group has been withdrawn from further consideration.   \ne. Not Applicable—The type of data identified in the ICE definition is not appropriate for the data model specification. It generally deals with data that applies to the structure or administration of the underlying IER as a formatted message. ICEs that are categorised as Not Applicable or Requirement Withdrawn are subtracted from the grand total. The result is labelled Requirement Total and it represents the basis for accounting the degree to which the model satisfies requirements. The basis ICEs then are assessed as Complete, Incomplete, or Clarification Needed. The column Percentage Completed expresses the ratio of Complete to Requirement Total. Summary of Initial Entry Requirements (IER) Completion Status Across Various Categories, Including ICE Grand Total, Not Applicable, Requirement Withdrawn, Requirement Total, Complete, Incomplete, Clarification Needed, and Percentage Complete.",
  "\"Table summarizing the status of various Information Exchange Requirements (IERs), including ICE Grand Total, Not Applicable, Requirement Withdrawn, Requirement Total, Complete, Incomplete, Clarification Needed, and Percentage Complete.\"",
  "2.5 Requirements during ATCCIS 2000 (Phase V) 2.5.1 Work on Article V requirements continued during Phase V. In addition, the Operational Group issued an additional set of requirements at first referred to as Peacetime Support Operations (PSO), later changed to Military Operations Other Than War (MOOTW)18. The latter usage prevailed throughout the phase; however, near the end of the phase NATO adopted the expression Crisis Response Operations (CRO) in lieu of MOOTW. 2.5.2 CRO requirements are listed in Table 7 to indicate the general categories that are covered. Detailed elements are not shown because they are stored in an Access database and are difficult to summarise except in the form shown here. The Operational Group drew upon multiple sources to produce a set that is unique to the ATCCIS programme and is not documented elsewhere. The categories are the same as for Phase IV; no adjustment is needed to the ICE Grand Total in this case since there are no ICEs that were withdrawn or did not apply. Summary of IER (Incident Event Report) Completion Status Across Various Categories, Showing ICE Grand Total, Complete, Incomplete, Clarification Needed, and Percentage Complete for Each Category, with an Overall Grand Total of 518 Reports and a 97% Completion Rate.",
  "2.5.2 In recognition of changing realities of potential NATO military operations, ATCCIS Heads of Delegation enlarged the scope in Phase V by adding requirements for joint interfaces that are needed to support land operations. Formal requirements were issued19 by the Operational Group and are listed in Table 8. The requirements are stored in the same database form as was the case for CRO. The table accounts for the ICEs in the same way as the previous table. Summary of Initial Entry Requirements (IER) Completion Status Across Various Military Operational Categories, Showing Grand Total, Complete, Incomplete, Clarification Needed, and Percentage Complete for Each Category.",
  "2.6 MIP Block 1 Work 2.6.1 Work on outstanding issues from the Article V, CRO and CJTF IERs continued during this phase of work. 2.6.2 The Data Modelling Working Party of the Data and Procedures Working Group was given a limited set of requirements extracted from the MIP Tactical C2IS Interoperability Requirement (MTIR). The additional requirements were derived from a comparison of MTIR requirements with the data specifications already present in C2IEDM. The added requirements were specific in nature; they are listed below: a. Identification of a service number for personnel.   \nb. Emission control policy for units, facilities, and equipment.   \nc. Mission Oriented Protective Posture (MOPP) for units.   \nd. CBRN threat levels for control features.   \ne. New requirements for domain values for events, facilities and organisations.   \nf. Capability to specify dimensions for facilities. 2.7 MIP Block 2 Work 2.7.1 A major task in Block 2 work was the merging of two data models: C2IEDM Edition 6.1 and the NATO Corporate Data Model Version 4.0. The major tasks involved a detailed comparison of specifications at entity, attribute, and domain levels and resolution of any differences in specifications (such as naming, definitions, or equivalent representations). Extensive quality review was imposed on all products that included the IDEF1X model itself, all documentation, and the data dictionary. The result was JC3IEDM Edition 0.5—an interim release in December 2004. 2.7.2 Work continued with issues remaining from Block 1 and structural improvements to the data specifications arising from new information exchange requirements as well as any deficiencies that were uncovered as the result of testing or analysis. Principal additions to the specification stemmed from several sources: air tasking order, maritime mine warfare, CBRN, Allied Command for Transformation, and the concept of Operational Information Group. 2.7.3 JC3IEDM version number has been changed to Edition 3.0 vice Edition 1.0 in order to bring it into correspondence with the intended use of the specification for testing in Block 3 of MIP programme of work that is scheduled to begin in 2009. 2.8 MIP Block 3 Work JC3IEDM evolution continued with remaining issues from requirements cited in Par 2.7.2. A major effort to expand the model specification entailed the concept of plans and orders in accordance with STANAG 2014 Edition 9. The accommodation of STANAG 2014 provisions creates a structure for the management of plans and orders, enables the combined use of data and textual elements as content, and smoothes the transition from purely text-based plans and orders to a largely structured form. ",
  "3. OVERVIEW OF THE DATA MODEL The overview presents principal features of the data structure that has been evolved to satisfy operational requirements. It also serves as an introduction to the detailed exposition of the data model specifications to be found in the remainder of the document. Section 3.1 summarises the basic concepts underlying the design of the data model. Section 3.2 serves as a broad guide to the contents of data model specification. The material from Section 3.3 to the end of the chapter constitutes a high-level overview of the model. The primary goal is to indicate the scope of the model in covering information categories of interest to the operational user. Examples and explanations attempt to use operational language as much as possible. 3.1 Concepts Underlying the Design of the Data Model 3.1.1 JC3IEDM is intended to represent the core of the data identified for exchange across multiple functional areas and multiple views of the requirements. Toward that end, it lays down a common approach to describing the information to be exchanged in a command and control (C2) environment. a. The structure should be sufficiently generic to accommodate joint, land, sea, and air environment concerns.21   \nb. The data model describes all objects of interest in the sphere of operations, e.g., organisations, persons, equipment, facilities, geographic features, weather phenomena, and military control measures such as boundaries.   \nc. Objects of interest may be generic in terms of a class or a type and specific in terms of an individually identified item. All object items must be classified as being of some type (e.g. a specific tank that is identified by serial number WS62105B is an item of type \"Challenger\" that is a heavy UK main battle tank).   \nd. An object must have the capability to perform a function or to achieve an end. Thus, a description of capability is needed to give meaning to the value of objects in the sphere of operations.   \ne. It should be possible to assign a location to any item in the sphere of operations. In addition, various geometric shapes need to be represented in order to allow commanders to plan, direct, and monitor operations. Examples include boundaries, corridors, restricted areas, minefields, and any other control measures needed by commanders and their staffs.   \nf. Several aspects of status of items need to be maintained.   \ng. The model must permit a description of the composition of a type object in terms of other type objects. Such concepts include tables of organisations, equipment, or personnel.   \nh. The model must reflect information about what is held, owned or possessed in terms of types by a specific object item.   \ni. There is a need to record relationships between pairs of items. Key among these is the specification of unit task organisations and orders of battle.   \nj. The model must support the specification of current, past, and future role of objects as part of plans, orders, and events.   \nk. The same data structure should be used to record information for all objects, regardless of their hostility status.   \nl. Provision must be made for the identification of sources of information, the effective and reporting times, and an indication of the validity of the data. ",
  "3.1.2 Use of free text is to be avoided as much as possible, since there cannot be an agreed understanding of the contents, and are not automatically processed by the C2 system. 3.1.3 Some of the important rules for managing information cannot be represented using the formal modelling standard; reliance needs to be placed on textual supplements, often referred to as “business rules.” 3.1.4 The overall goal is to specify the minimum set of data that needs to be exchanged in coalition or multinational operations. Each nation or agency or community of interest is free to expand its own data dictionary to accommodate its additional information exchange requirements with the understanding that the added specifications will be valid only for the participating nation, agency or community of interest. Any addition that is deemed to be of general interest may be submitted as a change proposal within the configuration control process to be considered for inclusion in the next version of the specification. 3.2 Guide to Contents 3.2.1 Introduction 3.2.1.1 There is no linear path that can be followed logically to a conclusion when one is dealing with a relational schema. The inherent use of relationships guarantees that almost any part of the specification depends on one or more of the other parts. Such crossdependence makes it difficult to organise the document in a sequence that would make it easy to comprehend the material. It may be necessary to move back and forth between chapters and between sections in a chapter as the role of relationships in avoiding redundant data becomes clearer. 3.2.1.2 The model in its most abstract sense may be thought of as a metamodel that provides the structural skeleton for following broad topics: a. Objects of interest and their inherent properties b. Past, present, or future situation as represented by facts about the objects c. Past, present, or future activities that involve the objects d. Mechanisms for grouping data into information packages. The content of the model in terms of attributes and sets of enumerated values represents the semantics of a given functional domain. The specific semantics of JC3IEDM flow from the requirements that are characterised in Chapter 2. However, the generic structural framework of the model readily supports extension of the model to accommodate additional domain semantics or even the conversion of the model represent the semantics of different domain. ",
  "3.2.1.3 The paragraphs below relate the broad topics cited in Paragraph 3.2.1.2 to the documentation. 3.2.2 Objects A basic task in data specification is defining the universe of discourse. The beginning is made by selecting the objects about which information is to be held. For JC3IEDM, these are facility, feature, materiel, organisation, and person either identified uniquely as items or used according to their class or type characteristics. Objects as items and objects as types are needed as structural elements. The model requires that every item object must be classified as a type object. The purpose is to place the characteristics of objects in the most appropriate location and avoid redundant specifications. 3.2.3 Situation The word situation encompasses a broad range of information about objects, including type-to-type relationships, item-to-type relationships other than the one cited in the previous paragraph, capabilities of either types or items, affiliation of types or items, status of items, location of items, addressing of items, and item-to-item relationships. There is no particular order that is more meaningful than another and the reader is encouraged to follow his or her primary interests. 3.2.4 Activity Activity encompasses planning of operations and reporting of events. Plans may be turned into orders. The basic specification of activity describes the use of objects as resources, objectives, or effects of activity. Extensions to enrich the specification of activity in several ways, including rules of engagements and creation of lists of candidate targets, is specified within the model structure. Further extension deal with requests in connection with intelligence collection. 3.2.5 Grouping of Information The model contains a structure entitled REPORTING-DATA that is related to most instances of dynamic data. The specifications permit collections of individual records to be treated as a package that is referred to as context. Context structure has multiple uses and can be linked to items and activities. There is also a provision for assessment to be attached to a context. Finally, there is a specification that permits descriptive information of various kinds to be attached to groups of person types. 3.3 Foundational Structural Elements 3.3.1 Entities 3.3.1.1 Basic concept in data specification is an entity, i.e., any distinguishable person, place, thing, event, or concept about which information is to be kept. Properties or characteristics of an entity are referred to as attributes. The attributes make explicit the data that are to be recorded for each concept of interest. This edition of the model contains 241 entities. The entire structure is generated from 15 independent entities, that is, entities ",
  "JC3IEDM OVERVIEW – UK – DMWG 16 February 2007 Edition 3.1a whose identification does not depend on any other entity. All other entities are dependent entities. Independent entities are defined in Table 9. The general role that each entity serves is also suggested. Entity Definitions and Their Roles in a Model Framework22 The convention is to annotate the names of entities in capital letters and separate words by hyphens. If the name of an entity is used in plural, then a lower-case “s” is appended to the name without changing the name (e.g., the plural of CAPABILITY is written CAPABILITYs). ",
  "Entity Definitions and Their Roles in the Model:\n\n- **REFERENCE**: A description of the source from which information, that may have military or civilian significance, is coming. Role: Pointing to external information in support of REPORTING-DATA.\n- **REPORTING-DATA**: The specification of source, quality and timing that applies to reported data. Role: Support for the reporting function.\n- **RULE-OF-ENGAGEMENT**: A specification of mandatory guidance for the way a given activity is to be executed. Role: Support to ACTION.\n- **SECURITY-CLASSIFICATION**: The security classification applicable to an information resource within the domain of classified security information. Role: Support to CONTEXT, NETWORK-SERVICE and REFERENCE.\n- **VERTICAL-DISTANCE**: A specification of the altitude or height of a point or a level as measured with respect to a specified reference datum in the direction normal to the plane that is tangent to the WGS84 ellipsoid of revolution. Role: Support to LOCATION in specifying elevation or height.3.3.1.2 The independent entities and their relationships are illustrated in Figure 2. A dot at the end of a relationship line denotes “many.” The relationships shown in this diagram are either many-to-many (solid line with two dots) or non-identifying one-tomany (dashed line). For example, the relationship between OBJECT-ITEM and LOCATION is to be interpreted as a pair of statements that an OBECT-ITEM may have zero, one, or more LOCATIONs and that a LOCATION may apply to zero, one, or more OBJECT-ITEMs. The entities that connect to the rest of the structure by means of nonidentifying relationships provide auxiliary specifications that are needed for precise definition of the concepts that are being captured. Some of the relationships are recursive, such as those relating ACTION to itself. 3.3.1.3 The IDEF1X standard permits the use of many-to-many relationships only at a conceptual level in explanatory diagrams such as this one. A fully developed data model must replace the many-to-many relationships with the appropriate structures that admit only one-to-many relationships. The resolution of many-to-many relationships can lead to complex structures. The balance of the paper describes the result for JC3IEDM. 3.3.1.4 All model explanations in this chapter are presented at the entity level as is the case in the preceding figure. The following section summarises the basic concepts underlying the data model. Subsequent chapters contain detailed descriptions of the fully attributed data model. 3.3.2 Identifying “Things” in the Sphere of Operations 3.3.2.1 “Things” must be identified as the first step—who are the actors and what things are available to be used by or are used by the actors? Model design encompasses two categories of objects: those that can be identified individually (by name—2 $( S P )$ Armoured Cavalry Brigade, Jubilation T. Cornpone, by call sign or serial number or license plate or passport number, and so on) and those that represent grouped or class properties (a tank, a ship, an M1A2 tank, a helicopter, a howitzer, a rifle, an armoured brigade, a light infantry battalion, an infantryman, a refugee). The two categories are used in parallel as basic structural elements of the model. The two structures are related to each other. Data characteristics are entered either on the item side or the type side as appropriate. Any characteristic described on the type side also applies to the item when the item is assigned a type classification. The linkage from item to type is mandatory in the model. ",
  "A hierarchical diagram illustrating the structure of a \"RULE-OF-ENGAGEMENT\" framework. It branches into categories such as \"CAPABILITY,\" \"ACTION,\" and \"OBJECT-TYPE,\" each further divided into subcategories like \"OBJECT-ITEM,\" \"CONTEXT,\" and \"LOCATION.\" Additional elements include \"CANDIDATE-TARGET-LIST,\" \"REPORTING-DATA,\" \"SECURITY-CLASSIFICATION,\" and specifics such as \"COMPONENT-HEADER-CONTENT,\" \"PLAN-ORDER,\" \"COMPONENT-TEXT-CONTENT,\" \"VERTICAL-DISTANCE,\" and \"RELATIVE-COORDINATE-SYSTEM.\" The diagram also encompasses \"AFFILIATION,\" \"GROUP-CHARACTERISTIC,\" and \"ADDRESS\" under broader classifications.3.3.2.2 JC3IEDM uses the name OBJECT-TYPE to refer to class objects and OBJECT-ITEM for individually identified instances. Implicit in the distinction between type and item is the assumption that data relating to OBJECT-TYPEs will tend to be relatively static or persistent (i.e., the values of the attributes are not likely to change very often over time), whereas the data characteristics related to OBJECT-ITEMs are likely to be more dynamic. For example, if a characteristic is about a type (e.g., M1A1 Abrams Tank), it is an attribute of OBJECT-TYPE. Thus, calibre of main gun, track width, and load class are characteristics of OBJECT-TYPE. However, the call sign, actual fuel level, munitions holdings, and current operational status of a specific tank are characteristics of an OBJECT-ITEM. At the same time, the mandatory classification of an instance of OBJECT-ITEM as an instance of OBJECT-TYPE assures that the item inherits all the characteristics of the type. 3.3.2.3 Item and type objects are subdivided into extensive hierarchies. The firstlevel hierarchy is parallel and is illustrated in Figure 3. There are five categories or subtypes to encompass any object within the scope of the model: facility, feature, materiel, organisation, and person. A subtype is the same thing as its parent, but it has some properties that do not apply to its siblings. Complete subtyping is denoted by a double line under the circle. It means that no other category is needed in response to the set of requirements that governed evolution of the model. A circle with one line underneath is a symbol for incomplete subtyping. It means that more subtypes could be defined if needed. Definitions of subtype entities are presented in Table 10. As may be expected, the two sets of definitions are similar. ",
  "A diagram illustrating the relationship between object types and object items. \"OBJECT-TYPE\" is connected to \"FACILITY-TYPE,\" \"FEATURE-TYPE,\" \"MATERIEL-TYPE,\" \"ORGANISATION-TYPE,\" and \"PERSON-TYPE.\" \"OBJECT-ITEM\" is linked to \"FACILITY,\" \"FEATURE,\" \"MATERIEL,\" \"ORGANISATION,\" and \"PERSON.\" The connection between \"OBJECT-TYPE\" and \"OBJECT-ITEM\" indicates a one-to-many relationship.Entity Definitions for Military and Administrative Contexts3.3.2.4 The next three sections present specification to describe (a) the hierarchical structure of types, (b) composition of types, and (c) the hierarchical structure of items. Major relationships that connect types and items are discussed in subsequent sections. ",
  "3.4 OBJECT-TYPE Hierarchy 3.4.1 The OBJECT-TYPE subtyping tree is extended beyond the first level as illustrated in Figure 4. FEATURE-TYPE has two subtypes, FACILITY-TYPE has four subtypes, MATERIEL-TYPE and ORGANISATION-TYPE have extensive subtype hierarchies; and PERSON-TYPE has no subtypes. Categorisation of OBJECT-TYPE can be done in different ways. There is no right or wrong way. The structure described in the figure happens to satisfy the stated information exchange requirements most closely. Hierarchical classification of object types, including categories such as Facility-Type (e.g., Airfield-Type, Bridge-Type), Person-Type, Materiel-Type (e.g., Consumable-Materiel-Type, Equipment-Type), Feature-Type (e.g., Control-Feature-Type, Geographic-Feature-Type), Organisation-Type (e.g., Civilian-Post-Type, Military-Organisation-Type), and Weapon-Type. Each category is further subdivided into specific types, providing a detailed taxonomy for various objects and entities.3.4.2 The specification permits a sixth categorisation of OBJECT-TYPE that is not visible in the diagram. It has the value “Unknown” in order to correspond to the same value on the item side. This categorisation is necessary to deal with detection and tracking problems where the exact classification of the detected object cannot be determined, but its existence must be recorded and information about it must be collected. ",
  "3.4.3 Most of the categories are reasonably self-explanatory with the possible exception of GROUP-ORGANISATION-TYPE, CIVILIAN-POST-TYPE, and MILITARY-POST-TYPE. GROUP-ORGANISATION-TYPE was created in response to CRO requirements to deal with groups that are not truly organisations but have to be treated as a collective object for data purposes. Consequently, groups of people such as refugees and prisoners of war are treated as pseudo-organisations. Post type is a type of position that is filled by a single individual, such as commander of a military unit or chief of a police department. It enables the set of duties inherent in a position or a billet to be distinguished from the type of person that may fill the post. 3.4.4 The figure displays two non-identifying relationships (dashed lines) with a diamond at one end and a dot at the other. A diamond indicates that the relationship is optional. No data need to be passed from one entity to the other. A dot has the same meaning as cited earlier—it is the many end of a one-to-many relationship. The relationship from EQUIPMENT-TYPE to UNIT-TYPE allows the identification of the major type of equipment that can be associated with a unit, e.g., Leopard III Main Battle Tank is the major equipment for a tank battalion. The relationship from UNIT-TYPE to MILITARY-ORGANISATION-TYPE permits a refinement in specifying headquarters units. For example, a headquarters company may be designed to serve a division or a brigade. This relationship enables an explicit association that states that an instance of a type headquarters company is intended to serve as the headquarters element of a type division. 3.5 Composition of Types (Establishment) 3.5.1 Concept of Establishment 3.5.1.1 Composition of types of objects needs to be represented in data. For example, a military organisation may specify that: a. A given type of unit is authorised to have quantities of various types of materiel (e.g., an artillery battery is authorised to have six howitzers).   \nb. A given type of formation is to be composed of quantities of types of units (e.g., a battalion is to include three companies and two supporting platoons).   \nc. A given type of unit is to consist of quantities of persons typed according to specialty and rank (e.g., an infantry squad is to consist of a senior sergeant, 2 corporals, and 12 riflemen having any one of three junior grades). 3.5.1.2 A specification for composition of a unit may include multiple types of things, such as the following: A French engineer regiment has a wartime establishment of 500 regular troops, 150 drivers, 100 vehicles, 20 minelayers, and 20,000 mines. 3.5.1.3 It may be necessary to capture a bill of materials or parts list for types of equipment in support of logistics. A parts list may catalogue components of a rifle, all items of equipment expected to be present on a combat-ready main battle tank, or enumerate all weaponry and equipment that is certified as a package for safe carriage on a given model of an F-16 fighter. ",
  "3.5.1.4 Every type of authorisation or statement of composition cited above can be represented using the concept of establishment. An establishment is an authorisation or other form of specification that associates, under specified conditions for a given instance of a type of object, a number of instances of other object types as its constituent elements. 3.5.2 Specification of Establishment 3.5.2.1 The structure is illustrated in Figure 5. An instance of OBJECT-TYPE may have one or more establishments assigned to it in OBJECT-TYPE-ESTABLISHMENT. The actual composition is specified in a child entity OBJECT-TYPE-ESTABLISMENTOBJECT-TYPE-DETAIL that lists the numbers of a specific OBJECT-TYPEs authorised in the establishment. The instances of OBJECT-TYPE that appear in the detail are identified through the relationship “is-specified-as-part-of.” OBJECT-TYPE  \nis-made-up-through / specifies-the-composition-of  \nOBJECT-TYPE-ESTABLISHMENT  \nidentifies-establishment-for-detail-object-type-in / references  \nis-specified-through / is-a-component-of  \nOBJECT-TYPE-ESTABLISHMENT-OBJECT-TYPE-DETAIL  \nis-specified-as-part-of / references  \nOBJECT-TYPE  \n3.5.2.2 The second non-identifying (dashed-line) relationship with the diamond at its head permits unambiguous re-use of data in building establishment hierarchies. For example, if a given company type has two establishments (say, summer peacekeeping and winter wartime) and it is being cited as a component of a new task force type, the relationship enables the selection of one of the two establishments. 3.5.2.3 Not all combinations of types are needed and some do not make sense. The allowable combinations are restricted by means of a business rule, as summarised in Table 11. ",
  "Matrix illustrating the relationships between different entity types (Facility-Type, Feature-Type, Materiel-Type, Organisation-Type, Person-Type), indicating compatibility or relevance with checkmarks and non-applicability with \"NA\".3.5.3 Assigning Establishments to Items Instances of establishments are assigned to instances of OBJECT-ITEM by means of the associative entity OBJECT-ITEM-OBJECT-TYPE-ESTABLISHMENT, as illustrated in Figure 6. Statements of the following kind can be recorded: As of 1 March 1997, the 19th (US) Mechanized Division is assigned a specific Type Mechanised Division Establishment for war operations in a temperate climate. OBJECT-TYPE  \nis-made-up-through / specifies-the-composition-of  \nOBJECT-TYPE-ESTABLISHMENT  \nis-assigned-through  \nOBJECT-ITEM-OBJECT-TYPE-ESTABLISHMENT  \nOBJECT-ITEM  \nis-assigned-establishment-through  \nOBJECT-ITEM-OBJECT-TYPE-ESTABLISHMENT3.6 OBJECT-ITEM Hierarchy 3.6.1 Full OBJECT-ITEM subtype hierarchy is illustrated in Figure 7. The reader should note that the structure below the first subtype level is not parallel to the type side. The design is deliberate in response to requirements. Subtypes are created only when there are information elements that belong to a single object category. For example, there is no subtype under OBJECT-TYPE that is equivalent to METEOROLOGIC-FEATURE; yet this entity has seven subtypes of its own. ",
  "JC3IEDM OVERVIEW – UK – DMWG 16 February 2007 Edition 3.1a Hierarchical classification structure for various object items, including categories such as Facility (e.g., Airfield, Basin), Feature (e.g., Control-Feature, Geographic-Feature), Materiel, Organisation (e.g., Unit, Convoy), and Person-related attributes. The diagram also details subcategories like Military-Obstacle (e.g., Minefield-Land, Minefield-Maritime) and Meteorologic-Feature (e.g., Atmosphere, Precipitation). Each category is linked through specific codes (e.g., facility-category-code, feature-category-code) to define relationships and classifications within the system.3.6.2 There is a sixth categorisation of OBJECT-ITEM with the value “Unknown” that is not visible in the diagram. It is needed for dealing with detection and tracking problems where the exact classification of the detected object cannot be determined initially, but its existence must be recorded and information about it must be collected. ",
  "3.6.3 Some characteristics of OBJECT-ITEM or one of its subtypes may require that multiple values be maintained in a database at the same time. The technique for handling such cases is to create child entities. A child entity depends on its single parent in a one-to-many relationship. The subtype hierarchy has seven instances of child entities as defined below with examples that illustrate reasons for multiple values: a. OBJECT-ITEM-ALIAS—An additional name for an OBJECT-ITEM. The child construct permits multiple names to be assigned to a single instance of OBJECTITEM.   \nb. NETWORK-CAPACITY—An identification of the specific capacities of a NETWORK. A network may use multiple bandwidths with different protocols on each.   \nc. NETWORK-FREQUENCY—The specification of a discrete frequency that is used on a specific NETWORK. A network uses multiple frequencies. It may be as simple as lower and upper bounds for a band or a set of frequencies for frequency hopping radios.   \nd. NETWORK-SERVICE—An identification of the specific type of communications service provided by a specific NETWORK. A network may simultaneously provide several services, the Internet being a good example.   \ne. PERSON-IDENTIFICATION-DOCUMENT—A document used to identify a specific PERSON. Almost every person carries multiple identification documents, such as driver licenses, military identification cards, and passports.   \nf. PERSON-LANGUAGE-SKILL—A proficiency or ability of a specific PERSON with regard to a specific language. A person may have skills in several languages or differing reading, writing and speaking skills in the same language.   \ng. MINEFIELD-MARITIME-CASUALTY-ESTIMATE—An estimate of the average number of casualties for a given number of vessel transits through a specific MINEFIELD-MARITIME. This entity, along with the entity in Bullet (h) enable the presentation of tabular data of specialised effectiveness for maritime minefields.   \nh. MINEFIELD-MARITIME-SUSTAINED-THREAT-MEASURE-OFEFFECTIVENTESS—A measure of effectiveness for a specific MINEFIELDMARITIME in terms of probability of mine function against a transit vessel over a given period of time. 3.6.4 Three other child entities of OBJECT-ITEM are not part of the subtype hierarchy. These are OBJECT-ITEM-STATUS and OBJECT-ITEM-ACCESS, as presented in the next two sections, and OBJECT-ITEM-GROUP-ACCOUNT that is discussed in a subsequent section. 3.7 Specifying Status of OBJECT-ITEMs 3.7.1 There is a general requirement of specifying the status of items at a given time (past, present, or predicted). The main topics include (a) classifying the hostility state of an OJECT-ITEM and (b) assigning categories to OBJECT-ITEMs to capture administrative, medical, physical, and procedural states or conditions. 3.7.2 Most objects of the battlefield can be characterised as friend or enemy. This information is not inherent to the specific object. The hostility status of an object is a classification that a specific organisation gives to this object. It means that a specific object may have different hostility status given by different organisations, and that the hostility status may vary with time. The known or perceived friendly or aggressive intentions of an object are recorded in the entity OBJECT-ITEM-HOSTILITY-STATUS whose structure of is illustrated in Figure 8. ",
  "OBJECT-ITEM has / is-ascribed-to OBJECT-ITEM-HOSTILITY-STATUS provides-applicable-information-for / is-referenced-to REPORTING-DATA3.7.3 The planning process and situational awareness require knowledge of the status of various objects. The status refers to the capability of these objects to perform their roles. This case is called operational status. For example, the operational status of a tank could describe the degree of damage it has suffered, its current mobility, or its capacity to fire its gun. The entity-level structure for capturing status is illustrated in Figure 9. 3.7.4 Subtypes of OBJECT-ITEM-STATUS hold the attributes that are tailored to describing the status of subtypes of OBJECT-ITEM. For example, the status of an enemy military ORGANISATION (a unit) could range from fully operational to destroyed; and the status of a soldier could be ready, incapacitated, wounded, absent, missing, arrested, captured, or killed. A control feature could be activated or deactivated. 3.7.5 Additional structure for MEDICAL-FACILITY-STATUS (not shown in the figure above) provides a number of details in terms of patient types, patient arrivals, medical condition types, surgical triage, surgical backlog, and disposition of patients. 3.7.6 Data structure permits multiple records to be kept about the status of an instance of OBJECT-ITEM to reflect changes that occur over time or differing status assessments that may be provided about a single OBJECT-ITEM by several units or organisations, particularly when the subject of the assessment is an element of the opposing force. ",
  "A hierarchical diagram illustrating the relationship between \"OBJECT-ITEM\" and various status categories, including CONTROL-FEATURE-STATUS, FACILITY-STATUS (with subcategories like AIRFIELD-STATUS, MEDICAL-FACILITY-STATUS, and MINEFIELD-MARITIME-STATUS), GEOGRAPHIC-FEATURE-STATUS (with subcategories such as LIQUID-BODY-STATUS, LIQUID-SURFACE-STATUS, and SOLID-SURFACE-STATUS), MATERIEL-STATUS (with subcategories like MINE-STATUS and UXO-STATUS), ORGANISATION-STATUS, and PERSON-STATUS. Each status category is linked through specific category codes to the overarching \"OBJECT-ITEM-STATUS.\"3.8 Specifying Access to OBJECT-ITEMs 3.8.1 There can be multiple ways to contact facilities, organisations, and persons, including anything from a postal address to a telephone number to a World Wide Web address. It also encompasses the use of call signs on radio nets since a call sign is a way of reaching a specified organisation or person and represents an address as much as an e-mail address. 3.8.2 The model permits access to be specified for any instance of OBJECTITEM through physical and electronic addressing. The physical addressing is a straightforward listing of the elements of an address in text form. All other accesses are defined in relation to a specified network and a specified service. 3.8.3 An instance of OBJECT-ITEM, such as a military unit, may be a subscriber to multiple services on a single network. It may also participate as a subscriber on several different networks. Subscription to a network need not be determined solely by the capabilities of equipment or software. The conditions of subscription may also be dictated by operational considerations. For example, specific permissions may be granted for active (i.e., transmitting) participation in certain networks, such as a command net or a fire support net, although any node with the proper equipment would be able to monitor net traffic without participating on the net. ",
  "3.8.4 The structure is illustrated in Figure 10. The ADDRESS structure provides a means for specifying an access address for an object. ADDRESS is an independent entity because a given address need not be owned by a specific object. This is most obvious in case of an office or house address where the occupancy can change but the address remains the same. A similar situation can occur in the electronic world where a telephone number may be re-assigned or an e-mail address shared by a number of individuals or offices. Entity-Relationship Diagram illustrating the connections between OBJECT-ITEM, FACILITY, NETWORK, ADDRESS, and related entities such as NETWORK-SERVICE, PHYSICAL-ADDRESS, ELECTRONIC-ADDRESS, and NETWORK-FREQUENCY. Relationships include \"has-for-address,\" \"is-reference-for,\" \"provides/is-provided-by,\" \"can-be-accessed-via/provides-access-to,\" and \"is-assigned-through.\"3.8.5 ADDRESS has two subtypes—PHYSICAL-ADDRESS and ELECTRONIC-ADDRESS—where the actual addresses are specified. The entity ELECTRONIC-ADDRESS has a mandatory non-identifying relationship from NETWORK-SERVICE to identify the type of service and the network that provides it. The structure permits any number of access specifications to be assigned to an instance of OBJECT-ITEM through the associative entity OBJECT-ITEM-ADDRESS. 3.9 Associations between OBJECT-ITEMs 3.9.1 Specification of Associations 3.9.1.1 Every instance of OBJECT-ITEM may have some type of relationship to another instance of OBJECT-ITEM in the sense of belonging, using, controlling, being constrained by, occupying and so on. For example, a division has full command of three brigades, or full command of two and operational control of the third if the third belongs to another nation. A specific main battle tank (MBT) is issued to a certain armoured infantry company. The model uses a simple structure to capture such information, as illustrated in Figure 11. The entity OBJECT-ITEM participates in an association twice: once as a subject and once as an object. The category codes that are at the heart of the specification are aligned to read from subject to object. The status entity that is attached to each association records whether the effective datetime provided through REPORTINGDATA is a start or end of an association. An association can be made and broken multiple times. ",
  "Entity-relationship diagram illustrating the connections between OBJECT-ITEM, ORGANISATION, OBJECT-ITEM-ASSOCIATION, OBJECT-ITEM-ASSOCIATION-STATUS, and REPORTING-DATA, detailing relationships such as \"is-the-subject-of,\" \"has/is-ascribed-to,\" and \"provides-applicable-information-for/is-referenced-to.\"3.9.1.2 Those OBJECT-ITEM associations that are deemed necessary to support C2 are supported in JC3IEDM in the form of associations shown in Table 12. The meaning of associations for eleven OBJECT-ITEM relationships are specified by a category code and in some cases an additional subcategory code. The allowable values for each association are listed as a business rule. Some examples of potential associations are illustrated in Table 13. ",
  "Object OBJECT-ITEMCaption: \"Table illustrating various examples of entities serving as different roles or functions across categories such as Organisation, Materiel, Control-Feature, and Facility.\"A table illustrating the situational relationships between various entities (Organisation, Materiel, Control-Feature, Geographic-Feature, Facility) and their respective locations within control-features, geographic-features, and facilities. Examples include \"Org1 is situated in Area of operation 1\" and \"Field Hospital1 is situated in Cave1.\"",
  "3.9.2 Organisational Structure 3.9.2.1 It is difficult to infer organisational hierarchies purely from instances stored in OBJECT-ITEM-ASSOCIATION. The hierarchy can be inferred by an exhaustive examination of relationship records. This section describes data specifications to enable appropriate relationships to be collected explicitly as part of a recognised group, such as an order-of-battle (ORBAT) or a unit task organisation (UTO). 3.9.2.2 The structure is illustrated in Figure 12. Any instance of ORGANISATION may have an ORGANISATION-STRUCTURE for which ORGANISATIONSTRUCTURE-DETAIL identifies all instances of OBJECT-ITEM-ASSOCIATION that pertain to the specific instance of ORGANISATION-STRUCTURE. This specification enables the re-use of any relationship recorded in OBJECT-ITEM-ASSOCIATION in multiple instances of ORGANISATION-STRUCTURE. ORGANISATIONSTRUCTURE is linked to ACTION-TASK through an optional non-identifying relationship that enables a given structure, such as UTO, to be associated with a plan or an operations order. Entity-Relationship Diagram illustrating the associations between Object-Item, Action, Organisation, Organisation-Structure, and related entities. Key relationships include \"is-the-subject-of,\" \"is-referenced-in,\" and \"is-specified-for,\" detailing how these entities interact within a structured organizational framework.3.10 Capabilities of Items and Types 3.10.1 Specifying and monitoring the capability of objects can be an important factor within the military planning process. Knowledge about capability may help in analysis of feasible actions that are open to friendly forces or in assessing the likelihood of actions that may be open to enemy forces. Capability statements can also be subject to various kinds of conditions. For example, the speed with which a vehicle can manoeuvre over land may depend on the type of terrain, and the range of a weapon may depend on the type of ammunition that is used. Capability structure is designed to embody two concepts: the need to characterise capability itself and to link it to other parts of the model that use specifications of capability. The structure is illustrated in Figure 13. ",
  "3.10.2 CAPABILITY is defined as “The potential ability to do work, perform a function or mission, achieve an objective, or provide a service.” The entity represents the list of generic capabilities that are available to objects and their types. This list covers a diverse range of abilities such as their maximum speed or their maximum storage capacity, some of which may not be applicable to certain classes of objects. The list of abilities is stored in the attributes capability-category-code that refers to a general class of abilities (e.g., the ability to transport things). The detailed ability is specified through category codes in the subtypes of CAPABILITY (e.g., the ability to transport a given amount of liquid). A diagram illustrating the relationships between various types of capabilities (such as storage, engineering, handling, etc.) and their associations with actions, object items, object types, facility types, materiel types, equipment types, and electronic equipment types. The chart uses terms like \"is-quantified-in,\" \"is-specified-with,\" and \"is-used-in-the-definition-of\" to describe these relationships, providing a structured overview of how different capabilities interact within a system or framework.3.10.3 Subtypes of CAPABILITY add amplifying information for certain classes of capability. Some are linked to subtypes of OBJECT-TYPE in order to permit more precise specification. For example, FIRE-CAPABILITY is linked to AMMUNITION",
  "JC3IEDM OVERVIEW – UK – DMWG 16 February 2007 Edition 3.1a TYPE, TRANSMISSION-CAPABILITY is linked to ELECTRONIC-EQUIPMENTTYPE, ENGINEERING-CAPABILITY is linked to FACILITY-TYPE and STORAGECAPABILITY is linked to OBJECT-TYPE. 3.10.4 CAPABILITY is linked to three independent entities in order to provide the following functions: a. Specify the expected or normal capability for OBJECT-TYPEs.   \nb. Estimate or record the actual capability of OBJECT-ITEMs.   \nc. State (through ACTION-REQUIRED-CAPABILITY) the required capability of OBJECT-ITEMs or OBJECT-TYPEs when they are needed as resources for carrying out ACTIONs. 3.10.5 Expected / Normal Capability. The entity OBJECT-TYPE-CAPABILITYNORM is defined as “The standard value of a specific CAPABILITY of an OBJECTTYPE.” Since the entity relates to types rather than items, the data it contains will tend to be static. The entity represents staff planning data concerning the capabilities of different OBJECT-TYPEs. The data can be used to: a. Provide a broad threat analysis in terms of enemy or potentially hostile OBJECTTYPEs.   \nb. Assist in the selection of friendly OBJECT-TYPEs for the tasks to be done.   \nc. Aid an application program in classifying OBJECT-TYPEs in accordance with operational user’s preferences. 3.10.6 Actual Capability. The capabilities of individual OBJECT-ITEMs may differ from the norm due to attrition or other factors. OBJECT-ITEM-CAPABILITY holds the perceived value of a specific CAPABILITY of an OBJECT-ITEM where it differs from the norm or where there is no norm. As well as recording detail of friendly troops, OBJECT-ITEM-CAPABILITY could hold a threat analysis for individual enemy OBJECT-ITEMs, e.g., an enemy tank regiment may have demonstrated a capability to move at a faster rate than its OBJECT-TYPE-CAPABILITY-NORM. 3.10.7 Required Capability. It is necessary to be able to specify a required CAPABILITY in order to complete an ACTION. This enables optimal resource usage for planning as well as for managing resources during the life of an ACTION. This subject is elaborated when extensions to ACTION structure are presented. 3.11 Positioning and Geometry for OBJECT-ITEMs 3.11.1 Concept for Representing Location and Geometry 3.11.1.1 The data structure under the independent entity LOCATION captures two distinct but related concepts of interest to planners and operators: (a) Specification of geometry that is required to describe objects;   \n(b) Placement of objects or their geometry with respect to the Earth's surface or with respect to each other. 3.11.1.2 The ability to specify geometry permits the description of various open or closed boundaries, such as areas of responsibility, orbits, phase lines, and objectives, as ",
  "well as the shape of airfields, runways, ammunition dumps, and a security fence surrounding an ammunition dump. The positioning of objects with respect to the Earth's surface is achieved by linking the entity OBJECT-ITEM to the LOCATION entity. 3.11.2 Overview of Location Structure 3.11.2.1 Overall structure for specifying location and geometry is shown in Figure 14 at the entity level. The LOCATION structure is self-contained and largely independent of other parts of the model. One exception occurs when a coordinate system is set up relative to some battlefield object. This is shown by the relationship between OBJECT-ITEM-LOCATION and OBJECT-REFERENCE. A hierarchical diagram illustrating the classification and relationships of various spatial and geometric entities, including categories such as LOCATION, VERTICAL-DISTANCE, GEOMETRIC-VOLUME, POINT, LINE, SURFACE, and their subcategories like CONE-VOLUME, SPHERE-VOLUME, ABSOLUTE-POINT, RELATIVE-POINT, POLYGON-AREA, and ELLIPSE. The diagram also includes references to systems like RELATIVE-COORDINATE-SYSTEM and OBJECT-ITEM-LOCATION, detailing their interconnectedness in defining spatial data structures.3.11.2.2 The basic element is a point; it plays a role in generating every other geometric construct in the specification. The location of the point can be expressed in absolute terms geographically with respect to Earth’s surface or in an Earth-centred cocordinate frame. It may also be located in relative terms with respect to another point that may be absolute or relative itself. The vertical distance for a point may be specified in several ways: as a measured altitude with respect to mean sea level, a measured height with respect to ground or water level, a pressure altitude or pressure height, or simply stated to be the local surface, as would be the case for an armoured vehicle moving through the countryside. ",
  "3.11.2.3 Lines are generated from a series of points that are connected in a specified order. The part of a line between two successive points is a line segment; a sequence of connected line segments defines the line, or more properly a polygonal path. A line may close on itself if the first and last points that define the line are the same; in this case a line may serve as a boundary for a surface. If the first and last points are not the same, then the line is an open line, such as a phase line or a one-way route. 3.11.2.4 Surfaces are built either directly from lines or the points provide part of the specification. For example, a polygon area is defined by a closed boundary line. An ellipse is completely defined by three points. Almost any figure, even an ellipse, could be approximated by a polygonal area; however, it is somewhat more efficient to provide explicit specifications for some of the figures that are called for in the operational requirements, and in some cases it is essential since not all geometric aspects can be completely described by polygons. For example, the specifications for corridor, orbit, and track require additional parameters. 3.11.2.5 Most volumes are built by using the horizontal projection of a surface onto the Earth’s surface to define the outer boundaries of a general cylinder and to specify the top and bottom vertical distances to close off the volume. Thus, any of the geometric figures that are constructed as surfaces can be the basis for a volume. Two additional volume geometries—cones and spheres—do not follow this pattern and require individual specifications. 3.11.3 Supporting Structures in LOCATION LOCATION structure is supported by additional specifications for vertical distance and a coordinate system to enable relative geometry. The independent entity VERTICALDISTANCE is a specification of the altitude or height of a point or a level as measured with respect to a specified reference datum in the direction normal to the plane that is tangent to the WGS84 ellipsoid of revolution. Specification of RELATIVECOORDINATE-SYSTEM enhances functionality of LOCATION by establishing a local reference frame. RELATIVE-COORDINATE-SYSTEM has two subtypes: one defines a coordinate system with respect to an arbitrary point and the second with respect to location of an object. If the object is moving or changing its orientation, then the coordinate system is also changing. Any geometry that is specified relative to this coordinate system will also move with it. 3.11.4 Linking LOCATIONs and OBJECT-ITEMs Model construct relates OBJECT-ITEM to LOCATION through the associative entity OBJECT-ITEM-LOCATION. The overall view for associating objects with LOCATION is presented in Figure 15. OBJECT-ITEM-LOCATION has a data attribute in OBJECT-ITEM-LOCATION to give operational meaning, as needed, to any geometry specified in LOCATION. ",
  "JC3IEDM OVERVIEW – UK – DMWG 16 February 2007 Edition 3.1a OBJECT-ITEM is-geometrically-defined-through OBJECT-ITEM-LOCATION  \nOBJECT-ITEM-LOCATION provides-geometric-definition-for LOCATION3.12 Relationships between Items and Types This section deals with three sets of direct relationships between items and types: classification of items according to type, possession of types by items, and the assignment of identifying codes to types of materiel for reporting purposes. 3.12.1 Classification of OBJECT-ITEMs by Type 3.12.1.1 A specific OBJECT-ITEM must be associated with at least one instance of OBJECT-TYPE. This is a fundamental structural feature of the model. Data elements are defined on the type or item side as is most appropriate and the information needs to be shared between the two sides. The ability to classify OBJECT-ITEMs as OBJECT-TYPE makes any information that is stored as type data applicable to the item. Thus, any characteristic of an item that can be described as a type property does not need to be carried as an attribute on the item side. 3.12.1.2 The linkage between item and type permits the recording of differing interpretations of what the type of an item may be, especially in regard to opposing forces or any other assessment that is based on uncertain or incomplete information. For example, Unit A may classify an unknown object first as a vehicle, then successively (as better information becomes available) an armoured vehicle, a tank, a main battle tank, and a T72. It also permits the recording of differing interpretations of the same object by different organisations. Unit B may be looking at the same object as Unit A but classify it successively as a vehicle and an APC. The structure also enables a history of classifications to be kept as a means for understanding the decisions that were made at the time a classification was considered valid. In other words, the data may be able to provide exonerating evidence in case of a court martial. 3.12.1.3 The associative entity OBJECT-ITEM-TYPE is defined as “A record of the perceived classification of a specific OBJECT-ITEM as a specific OBJECT-TYPE.” The structure is illustrated in Figure 16. The relationship is read as follows: an OBJECTITEM is classified as one or more OBJECT-ITEM-TYPEs. The letter $\\mathrm { P }$ at the “many” end stands for “positive.” P designation makes the classification of an instance of OBJECTITEM mandatory rather than optional. Note that any number of instances of OBJECTTYPE may be carried as reference data without being associated with any instance of OBJECT-ITEM. ",
  "JC3IEDM OVERVIEW – UK – DMWG 16 February 2007 Edition 3.1a OBJECT-ITEM  \nis-classified-as  \nOBJECT-ITEM-TYPE  \nOBJECT-TYPE  \nis-used-as-a-classification-for  \nP3.12.2 Holdings and Transfers by Items 3.12.2.1 The purpose of HOLDING and HOLDING-TRANSFER specifications is to provide commanders with a dynamic update of changes to information on stockpiles of specific equipment and consumable materiel held by national or multinational forces declared to an operation, as well as specified equipment and materiel held by various formations in support of such forces. 3.12.2.2 The staff officer may wish to know how many tanks of a given type a certain unit possesses and how many of them are operational, or how many enemy companies there are within a given area (an instance of CONTROL-FEATURE), or how many rounds of an ammunition type are stored in a particular arsenal, or how many cargo pallets are contained on a particular airlift aircraft, or how many mechanics does a given maintenance company have, or which types of weapons and sensors are held by a specific weapons platform (e.g., instance of an aircraft or tank)23. 3.12.2.3 The structure is illustrated in Figure 17. 3.12.2.4 The entity HOLDING addresses the association of a specific object (OBJECT-ITEM) with a class of objects (OBJECT-TYPEs) where the relationship is defined by the general notion of inclusion in the sense of ownership, possession, assignment, or control. Each count of the number of a class in a HOLDING is subject to a qualifying condition. 3.12.2.5 Holding specifies what an OBJECT-ITEM actually has or is estimated to have at a particular time. The holding may be an estimate for a future date, such as the expected count of a given type of equipment a week from now. In this way, expected replenishment or repair of materiel can be reflected in the holdings that serve as one of the sources of information for combat operations planning. 3.12.2.6 The entity HOLDING-TRANSFER supports the recording of logistic transactions, such as losses or gains. Its specifications enable it to indicate the reason for a transfer, the quantity of a transfer, and the corresponding instance of OBJECT-ITEM that is the providing or receiving agent in a transaction. ",
  "JC3IEDM OVERVIEW – UK – DMWG 16 February 2007 Edition 3.1a The image depicts a conceptual model with entities and their relationships:\n\n- **OBJECT-ITEM** has/belongs-to **HOLDING**\n- **OBJECT-TYPE** is-subject-of/is-constrained-to **HOLDING**\n- **OBJECT-TYPE** is-correspondent-in/is-transaction-for **HOLDING-TRANSFER**\n- **HOLDING** is-changed-by/changes **HOLDING-TRANSFER**\n- **REPORTING-DATA** provides-applicable-information-for/is-referenced-to **HOLDING-TRANSFER**\n- **REPORTING-DATA** provides-applicable-information-for/is-referenced-to **HOLDING**3.12.2.7 Previously discussed establishment indicates what an organisation or materiel is supposed to be composed of or is authorised to have; HOLDING captures what the organisation has or materiel actually contains (or is thought to have) at a particular time. The comparison of the two sets of numbers enables a number of staff evaluations, such as the setting of logistic/personnel replenishment requirements, an assessment of organisational capability, or need for requisition. 3.12.3 Identifying Reportable Items 3.12.3.1 An organisation, such as NATO HQ or a regional headquarters, may create lists of materiel types using a standard coding scheme for reporting purposes, such as Land Forces Reportable Item List (LFRIL) or Reportable Item Code (RIC). An organisation may choose to create these types of codes in order to enforce standard reporting about equipment (type of materiel) that its subordinate organisations hold. 3.12.3.2 The model includes an entity ORGANISATION-MATERIEL-TYPEASSOCIATION in order to enable the designation a reporting code for instances of MATERIEL-TYPE. The linkage to organisation is necessary since the codes depend on the establishing organisation. The structure is illustrated in Figure 18. ORGANISATION assigns-reporting-code-in ORGANISATION-MATERIEL-TYPE-ASSOCIATION is-assigned-reporting-code-in MATERIEL-TYPE",
  "3.13 Plans and Orders 3.13.1 The basic operational requirements for plans and orders are the provisions of STANAG 2014 Edition 9. The data schema is designed to: a. Satisfy most STANAG 2014 requirements in storing a plan or order in data and maintaining the proper structure or paragraphing,   \nb. Enable the use of the ACTION and other JC3IEDM specifications of structured data to represent those parts of a plan or order that are appropriate for structured data,   \nc. Permit the use of textual information to specify those parts of a plan or order that cannot be expressed as structured data,   \nd. Permit the use of textual information to supplement those parts of a plan or order that are represented as structured data. The structure is shown in Figure 19. A hierarchical diagram illustrating the structure and relationships of various components within a planning and ordering system. Key elements include \"PLAN-ORDER,\" \"PLAN-ORDER-COMPONENT,\" \"OBJECT-ITEM,\" \"ORGANISATION,\" \"CONTEXT,\" and their respective subcomponents such as \"PLAN-ORDER-HEADER-CONTENT,\" \"COMPONENT-TEXT-CONTENT,\" and \"OPERATIONAL-INFORMATION-GROUP.\" The diagram also highlights associations, distributions, statuses, and security classifications related to plan orders and their components.3.13.2 PLAN-ORDER is the top-level entity through which warning orders, plans, operation orders, fragmentary orders, separate annexes, and any other document identified in STANAG 2014 can be managed. The content that applies to the entirety of a PLANORDER is specified in PLAN-ORDER-HEADER-CONTENT. ",
  "3.13.3 The detailed content for an instance of PLAN-ORDER is specified using the child entity PLAN-ORDER-COMPONENT. It serves as the basis for collecting all of the information that is attendant to the component. It handles the following tasks: a. Multilayer hierarchical structuring among the components in terms of their relative position within a plan or order as well as linking components from one instance of PLAN-ORDER to another.   \nb. Providing substantive content for each component. This is accomplished through PLAN-ORDER-COMPONENT-CONTENT that acts as a collector of applicable information by providing points of attachment for groups of data from other parts of the model, such as header, textual information, structured data information, and external references. 3.13.4 Supporting structures deal with relationships between an instance of PLAN-ORDER to ORGANISATION and between different instances of PLAN-ORDER; distribution lists and acknowledgements; and the grouping of instances of PLAN-ORDER into OIGs for dissemination. 3.13.5 ORGANISATION-PLAN-ORDER-ASSOCIATION enables the identification of the organisation responsible for the plan as well as the organisation (oneperson post, such as the commander) that authorises the plan. The individual who occupies the post can be identified in the existing data structure via association between PERSON and an ORGANISATION that is a post. The entity ORGANISATION-PLAN-ORDERASSOCIATION-STATUS specifies the starting or stopping of the associations. 3.13.6 PLAN-ORDER-ASSOCIATION permits the management of plans in terms of succession. The functionality includes attaching separately managed annexes to the main plan, the instances of PLAN-ORDER that turn a plan into an order, and FRAGO instances that modify an order. 3.13.7 STANAG 2014 specifies distribution lists and a need for acknowledgement. The proposal provides for these requirements through the entities PLAN-ORDER-DISTRIBUTION and PLAN-ORDER-DISTRIBUTIONACKNOWLEDGEMENT. 3.13.8 The proposal includes two status entities to keep track of progress of instances of a plan or an order via the entities PLAN-STATUS and ORDER-STATUS. 3.13.9 The entity OPERATIONAL-INFORMATION-GROUP-PLAN-ORDERCONTENT enables the identification of instances of PLAN-ORDER as a coherent group that is attached to an OPERATIONAL-INFORMATION-GROUP that is then used as a mechanism in replication. A specific example would be the grouping of a main plan and its separately managed annexes. ",
  "3.14 ACTION: Structured Specification of Activity 3.14.1 Introduction 3.14.1.1 This chapter describes the basic concepts for representing activity in the model. The independent entity ACTION is the root for this representation. The related structure includes mechanisms for specifying items or types as resources and objectives for activity, recording effects of activity, classifying activities as planned tasks or unplanned events, keeping status of activities, and relating activities to each other functionally and temporally. 3.14.1.2 ACTION together with its substructures specifies and describes operations planned for, or carried out, in the sphere of operations. It is also used to describe unplanned happenings that are of military interest. The underlying concept for modelling ACTIONs is based on a statement in which something carries out an activity to affect something at some time. Within the model, the \"something\" within the basic action statement is described by an OBJECT-TYPE or an OBJECT-ITEM. Thus, OBJECTTYPEs and OBJECT-ITEMs are related to ACTION in three distinct ways: as resources objectives, and subjects of effects, as illustrated in Figure 20. The figure also shows two associations that link sets of ACTIONs functionally and temporally. Functional associations enable the building of complex statements, such as operations orders, from simple statements in cascading hierarchies. Temporal associations provide for timing of ACTIONs in relation to one another. A diagram illustrating the hierarchical relationships between various action-related concepts. At the top, \"ACTION\" branches into \"ACTION-FUNCTIONAL-ASSOCIATION\" and \"ACTION-TEMPORAL-ASSOCIATION.\" Below, \"ACTION-RESOURCE,\" \"ACTION-OBJECTIVE,\" and \"ACTION-EFFECT\" are interconnected, with all three linking to \"OBJECT-TYPE\" and \"OBJECT-ITEM\" at the bottom. The connections suggest a structured framework for understanding actions in terms of their resources, objectives, effects, and associated objects.3.14.2 Role of Objects as Resources, Objectives, and Subjects of Effects 3.14.2.1 Resources are those items and types that have been specified as the things performing, things being used in or allocated to, or things whose use is qualified in some way, in carrying out a specific ACTION. Objectives are those types or items that are specified to be (or excluded from) the focus of an ACTION. As an example of resources and objectives, the 11th (NL) Air Mobile Brigade may use 4 Chinook helicopters (an ",
  "ACTION-RESOURCE) to transport 100 troops to a landing zone (ACTIONOBJECTIVE). 3.14.2.2 Effectiveness of operations needs to be monitored and the potential effects of planned or pending activity need to be estimated. For example, the reported result may be that the enemy force has been diminished by at least 50 percent and the enemy position was captured. 3.14.2.3 The ACTION-EFFECT estimate specifies a quantity if the objective is an type, or a fraction if the objective is an item. Operations performance could be evaluated by comparing ACTION-EFFECTs to stated ACTION-OBJECTIVEs. ACTIONEFFECT permits the capture of information about effects of ACTIONs whether intended or not. This may be collateral damage, for example, where the intended target was an ammunition plant but a nearby hospital was hit. 3.14.3 Relating ACTIONs 3.14.3.1 General. The promulgation and understanding of an operations order is dependent upon the complex linkage of a series of assigned actions (tasks). These tasks are linked functionally (e.g. The Corps Barrier Zone Completion is decomposed into several Divisional Barrier Zone tasks which is then further decomposed into Brigade Barrier Zone tasks and so on). There is also a temporal dimension that indicates that Action A cannot start before Action B is completed (e.g., A unit cannot achieve Phase Line 2 until it has achieved Phase Line 1. The model provides two associative entities that specify the dependencies between ACTIONs and allow for the creation of hierarchies: a. ACTION-FUNCTIONAL-ASSOCIATION caters to functional relationships; and b. ACTION-TEMPORAL-ASSOCIATION caters to time-specific dependencies between ACTIONs. 3.14.3.2 The simplest relationship is where an ACTION includes a number of other subordinate ACTIONs. This is represented in Figure 21, where Action 2 is the major action that is supported by Action 1. Action 1 consists of four ACTIONs (Action 3 to Action 6); three of the actions are subordinated to Action 1 directly (Action 3 to Action 5), while the fourth action (Action 6) is subordinated to Action 5. In this example, the relationship hierarchy can be represented by the phrases as \"Is a sub-Action of\" in case of connecting lines and \"In order that\" for the support. A flowchart illustrating a sequence of actions where \"Action 1\" leads to \"Action 2\" via \"in order that,\" with \"Action 1\" branching into \"Action 3,\" \"Action 4,\" and \"Action 5,\" the latter of which further branches into \"Action 6.\"",
  "3.14.3.3 ACTION-TEMPORAL-ASSOCIATION. The timings of sub-actions that are part of a complex action will frequently be interdependent. The entity ACTIONTEMPORAL-ASSOCIATION is designed to handle the data requirements associated with temporal dependencies between ACTIONs. ACTION-TEMPORAL-ASSOCIATION is the assignment of an ACTION (i.e., ACTION-TASK) to be time-dependent for its execution on another ACTION (e.g., ACTION-EVENT or ACTION-TASK). 3.14.3.4 ACTIONs can be related together in very complex ways using the concepts of absolute time, temporal relationships, and temporal relationships with offset intervals. It is possible to formulate plans without specifying a particular start time (or Hhour) while still being able to specify the interrelated time dependencies between its constituent sub-actions. In order to fix a start time for such a plan, it is merely necessary to introduce a new ACTION, with a specified planned start time, and relate it to the ACTIONs to be initiated, e.g., H-hour will be 0900, 15 August 2006. 3.14.4 Subtypes of ACTION 3.14.4.1 ACTION structure is shown in Figure 22. It has two subtypes— ACTION-EVENT and ACTION-TASK—in order to describe two kinds of activities that entail different data requirements. The entity ACTION-EVENT-DETAIL captures addition information about events. Six entities—CBRN-EVENT, CHEMICALBIOLOGICAL-EVENT, RADIOACTIVE-EVENT, NUCLEAR-EVENT, RADIOLOGICAL-EVENT, and NUCLEAR-WEAPON-EVENT—are subtypes under ACTION-EVENT to handle specialised chemical-biological-radiological-nuclear data requirements. The two status entities allow progress of activities to be recorded. 3.14.4.2 ACTION-TASK is defined as “An ACTION that is being or has been planned and for which the planning details are known.” It concerns those ACTIONs over which control can be exercised or which are predicted (such as friendly operations, and those enemy activities that are being anticipated as a result of intelligence assessment). It can represent actions that are typically found in plans, orders, and requests. 3.14.4.3 ACTION-EVENT is defined as “An ACTION that is an incident, phenomenon, or occasion of military significance that has occurred or is occurring but for which planning is not known.” This entity is intended to capture ACTIONs that simply occur and need to be noted. An ACTION-EVENT may trigger an ACTION-TASK. For example, the encounter of a scattered minefield near the landing zone will result in an evasive manoeuvre. An observer in the field may also use ACTION-EVENT to report his sightings that result from a recorded ACTION-TASK of which he has no knowledge. 3.14.4.4 Status entities permit the monitoring of the effectiveness and progress of both tasks and events as follows: a. ACTION-TASK-STATUS captures the perceived appraisal of the planning and execution progress of a particular ACTION-TASK in fractional terms or through the reporting of actual starting and ending times.   \nb. ACTION-EVENT-STATUS reports the perceived appraisal of the actual progress of an ACTION-EVENT as determined by the reporting organisation. The progress is estimated fractionally at a given time. Fractions are expressed as ratios in the ",
  "JC3IEDM OVERVIEW – UK – DMWG 16 February 2007 Edition 3.1a specification; therefore, ration value of 0 would coincide with a starting datetime and ration value of 1 with the end. A hierarchical diagram illustrating the categorization of actions and events, starting from a general \"ACTION\" category and branching into specific types such as \"ACTION-TASK,\" \"ACTION-EVENT,\" \"CBRN-EVENT,\" \"CHEMICAL-BIOLOGICAL-EVENT,\" \"RADIOACTIVE-EVENT,\" \"NUCLEAR-EVENT,\" \"RADIOLOGICAL-EVENT,\" and \"NUCLEAR-WEAPON-EVENT.\" Each category is linked with corresponding status or detail subcategories, and specific event types are further classified by their respective event category codes.3.15 Broadening Functionality of ACTION 3.15.1 Introduction A number of model constructs add to the scope of data that can be captured to enrich a specification of ACTION: a. Marking objectives   \nb. Extending specification of ACTION-OBJECTIVE to TARGET   \nc. Extending specification of ACTION-TASK to REQUEST   \nd. Specifying required capabilities   \ne. Designating roles of an organisation with respect to ACTION   \nf. Specifying constraints or guidance on the use of ACTION-RESOURCE   \ng. Imposing rules of engagement   \nh. Providing CANDIDATE-TARGET-LIST as an aid in operational planning   \ni. Linking ACTION to CONTEXT as a mechanism for specifying or recording starting, intermediate, or ending conditions. ",
  "3.15.2 Marking ACTION-OBJECTIVE-ITEM and Its Role as a Target 3.15.2.1 Some instances of ACTION-OBJECTIVE-ITEM may need to be marked in some way either to avoid fratricide or more often to be designated as targets. The instances of ACTION-OBJECTIVE-ITEM that are actually targets require additional data specifications. The latter use entails two entities—TARGET and its child entity TARGET-PERSONNEL-PROTECTION, as illustrated in Figure 23. A diagram illustrating the relationships between various entities such as ACTION-OBJECTIVE, OBJECT-ITEM, ORGANISATION, ACTION-OBJECTIVE-ITEM, TARGET, REPORTING-DATA, and TARGET-PERSONNEL-PROTECTION. The connections are defined by specific roles or actions, such as \"is-authority-for-the-use-of,\" \"is-specified-as,\" \"is-the-user-of,\" \"is-indicated-by,\" \"is-the-reporting-agent-for,\" \"is-recognised-as-having,\" and \"provides-applicable-information-for.\" Each entity is linked through these defined relationships, forming a structured network of interactions and dependencies.3.15.2.2 ACTION-OBJECTIVE-ITEM-MARKING is defined as “The technique of indicating the position of an ACTION-OBJECTIVE-ITEM at a given time for the benefit of a using ORGANISATION.” Assignment of the resource that provides marking services is specified in ACTION-TASK. ACTION-OBJECTIVE-ITEMMARKING provides an opportunity to add coordinating details for the user of the marking services. 3.15.2.3 TARGET provides additional data about an ACTION-OBJECTIVEITEM when it is the focus of air-defence, direct fire support, reconnaissance, and other operational tasks. 3.15.2.4 TARGET-PERSONNEL-PROTECTION is defined as “An assessment of the general protective posture of personnel with respect to first and second volleys for the specific TARGET.” The protective posture refers to states such as standing, prone, dug in, and under cover. It captures the change of state, if any, between the first volley and the second volley. For example, personnel may have been prone at the first volley, but may be dug in at the second volley. ",
  "3.15.3 REQUEST for Intelligence and Combat Information 3.14.3.1 Requests for intelligence need to be linked to the products of surveillance and reconnaissance. A REQUEST is a special instance of ACTION-TASK that can use all the functionality of the ACTION structure to specify a requirement to collect information. The execution planning in response to the request would be done within the same structure as any other ACTION. Once the collection is complete, one or more REQUEST-ANSWERs can be created. The structure for REQUEST-ANSWER is illustrated in Figure 24. A flowchart illustrating the hierarchical structure of an action process, starting from \"ACTION\" which branches into \"ACTION-TASK\" and \"ACTION-EVENT\". \"ACTION-TASK\" further leads to \"REQUEST\", which is connected to \"REQUEST-ANSWER\". \"REQUEST-ANSWER\" is linked to \"REQUEST-ANSWER-ELEMENT\" and \"REPORTING-DATA\", with various relationships such as \"results-in / is-a-response-to\", \"is-comprised-of\", \"provides-applicable-information-for / is-referenced-to\", and \"is-part-of\" depicted between these elements.3.15.3.2 Affirmative REQUEST-ANSWER indicates that additional information may be recorded elsewhere in the model. The pointer to such information is implemented through the entity REQUEST-ANSWER-ELEMENT. For example, a hostile unit may have been located at a given coordinate as a result of a search for enemy units in a prescribed region. This information would be recorded in OBJECT-ITEM-LOCATION that is linked to REPORTING-DATA (a topic described in a subsequent section). An instance of REQUEST-ANSWER-ELEMENT would then be able to indicate the correct instance of REPORTING-DATA that is part of the REQUEST-ANSWER. ",
  "3.15.3.3 Negative entry in REQUEST-ANSWER is actually a genuine piece of information that cannot be recorded elsewhere. If the search for hostile units results in none being found, then that finding is recorded in REQUEST-ANSWER. 3.15.4 Capabilities Required for an ACTION 3.15.4.1 The ability to specify a required CAPABILITY in order to complete an ACTION is necessary for planning optimal employment of resources and for managing resources during the life of an ACTION. ACTION-REQUIRED-CAPABILITY is defined as “The specific CAPABILITYs required to satisfy an agreed operational need (an ACTION).” 3.15.4.2 Use of this construct permits the matching of the available capabilities of objects or their types to the required capabilities in the selection of the most appropriate resources. Also, if the ACTION-REQUIRED-CAPABILITY is known, and, if a resource that was selected to match a CAPABILITY was suddenly not available or was no longer able to provide the requisite CAPABILITY, the knowledge helps a planner to allocate replacement assets. 3.15.5 Role of an ORGANISATION with Respect to an ACTION 3.15.5.1 Specifying Additional Roles. The addition of an associative entity between ACTION and ORGANISATION (ORGANISATION-ACTIONASSOCIATION) permits the explicit specification of any role or roles that an ORGANISATION may have in relation to an ACTION over and above those implicit in the role of an organisation as an ACTION-RESOURCE. The roles could include initiation, coordination, planning, authorisation, oversight, distribution of orders and so on. 3.15.5.2 Specifying Commander's Intent/Concept of Operations. The second, important function of the entity ORGANISATION-ACTION-ASSOCIATION is to enable the specification of commander’s intent or concept of operations for an ACTION. Generally, this would be the top-level or mission task statement for a unit. 3.15.6 Guidance for Use of Resources 3.15.6.1 The structure consists of ACTION-RESOURCE-EMPLOYMENT and its subtypes ACTION-AIRCRAFT-EMPLOYMENT, ACTION-ELECTRONICWARFARE-EMPLOYMENT, ACTION-MARITIME-EMPLOYMENT, and ACTIONRECONNAISSANCE-EMPLOYMENT. These entities enable the operational planner to provide additional guidance in the employment of resources either in relation to a specific objective or independently of it. The structure is illustrated in Figure 25. 3.15.6.2 ACTION-RESOURCE-EMPLOYMENT is defined as “The procedure for using a specific OBJECT-TYPE or OBJECT-ITEM against an objective in an ACTION.” It specifies additional guidance in the use of resources for a specific activity. The use may also depend on the objective of the activity. ",
  "A diagram illustrating the relationships and categories within an action framework, including ACTION, ACTION-RESOURCE, ACTION-OBJECTIVE, ACTION-RESOURCE-EMPLOYMENT, and specific employment types such as ACTION-AIRCRAFT-EMPLOYMENT, ACTION-ELECTRONIC-WARFARE-EMPLOYMENT, ACTION-MARITIME-EMPLOYMENT, and ACTION-RECONNAISSANCE-EMPLOYMENT. The connections are defined by terms like \"requires,\" \"is-focused-on,\" \"is-used-according-to,\" and \"is-the-subject-of.\"3.15.6.3 ACTION-AIRCRAFT-EMPLOYMENT is defined as “The procedure that guides the utilisation of an ACTION-RESOURCE that is capable of atmospheric flight.” The structure is currently used to specify some restrictions on aircraft employment that are intended to avoid harm to friendly troops and that also may be useful for deconflicting fires. The main data elements are: approach offset code, terminal attack direction angle, egress direction angle, deplanement method code, and in-flight report requirement indicator code. 3.15.6.4 ACTION-ELECTRONIC-WARFARE-EMPLOYMENT is defined as “The technique used by an ACTION-RESOURCE for Electronic Warfare by electronic or mechanical means.” The structure is currently used to specify electronic or mechanical means to conduct both offensive measures and defensive countermeasures. 3.15.6.5 ACTION-MARITIME-EMPLOYMENT is defined as “The procedure that guides the use of an ACTION-RESOURCE in a maritime environment.” The structure is currently used to specify the parameters for coordinated air/sea procedures. 3.15.6.6 ACTION-RECONNAISSANCE-EMPLOYMENT is defined as “The parameters that guide the use of an ACTION-RESOURCE that is employed in a reconnaissance role.” The structure is currently used to specify the parameters for collection, such as expected extent of target coverage, whether the coverage should be mono or stereo, and the type of sensor to be used. 3.15.7 Rules of Engagement 3.15.7.1 Rules of engagement need to be applied to operational activities. The functions include the imposition of a rule of engagement by an authorising agency, a request to be relieved from a rule of engagement and the consequent authorisation for ",
  "JC3IEDM OVERVIEW – UK – DMWG 16 February 2007 Edition 3.1a relief if appropriate, and a request that a rule of engagement be imposed and the consequent authorisation for it if appropriate. The model incorporates for this purpose a structure illustrated in Figure 26. The image depicts a conceptual model or entity-relationship diagram illustrating the relationships between various entities in a structured system. Here are the key elements and their relationships:\n\n1. **ACTION**: Linked to \"action-category-code\" and connected to \"ACTION-TASK\".\n2. **ACTION-TASK**: Connected to \"ACTION\" and linked to \"ACTION-TASK-RULE-OF-ENGAGEMENT\" through \"is-constrained-by\" and \"is-a-constraint-on\".\n3. **RULE-OF-ENGAGEMENT**: Connected to \"ACTION-TASK-RULE-OF-ENGAGEMENT\" and \"ORGANISATION-ACTION-TASK-RULE-OF-ENGAGEMENT-STATUS\".\n4. **OBJECT-ITEM**: Linked to \"object-item-category-code\" and connected to \"ORGANISATION\" through \"is-the-owner-of\".\n5. **ORGANISATION**: Linked to \"OBJECT-ITEM\" and \"ACTION-TASK-RULE-OF-ENGAGEMENT\" through \"specifies\".\n6. **ACTION-TASK-RULE-OF-ENGAGEMENT**: Serves as a bridge between \"ACTION-TASK\" and \"RULE-OF-ENGAGEMENT\", and is connected to \"ORGANISATION-ACTION-TASK-RULE-OF-ENGAGEMENT-STATUS\".\n7. **ORGANISATION-ACTION-TASK-RULE-OF-ENGAGEMENT-STATUS**: Integrates \"ORGANISATION\", \"ACTION-TASK\", and \"RULE-OF-ENGAGEMENT\".\n\nThis diagram outlines how actions, tasks, rules of engagement, object items, and organizations interrelate within a defined framework, emphasizing constraints, ownership, and specification roles.3.15.7.2 RULE-OF-ENGAGEMENT is defined as “A specification mandatory guidance for the way a given activity is to be executed.” In essence, it provides a list of rules. ACTION-TASK-RULE-OF-ENGAGEMENT is defined as “The imposition of a specific RULE-OF-ENGAGEMENT on a specific ACTION-TASK.” It links rules to an activity. ORGANISATION-ACTION-TASK-RULE-OF-ENGAGEMENT-STATUS is defined as “The status of the relationship between a specific ORGANISATION and a specific ACTION-TASK-RULE-OF-ENGAGEMENT with respect to a request for an application, a request for cancellation, or an authorisation.” It is a mechanism for managing rules of engagement. 3.15.8 Candidate Target Lists 3.15.8.1 The primary purpose of this structure is to enable the building of target lists for consideration during planning processes. The notion of a potential target is different from the notion of TARGET (a model entity) that is actually specified as an objective of an activity. The structure permits the nomination of targets at any number of echelons with or without a change in target numbering. An item or type may be nominated as a target multiple times, possibly with a different activity focus in each nomination. The authorisation of candidate targets may also occur at multiple levels. 3.15.8.2 The structure to record potential targets includes two tiers of entities: the first to create candidate target lists and the second to itemise candidate targets individually. The entities CANDIDATE-TARGET-LIST and CANDIDATE-TARGETDETAIL serve this purpose. Authorisations for lists in their entirety and individual targets separately are provided through CANDIDATE-TARGET-LIST-AUTHORISATION and CANDIDATE-TARGET-DETAIL-AUTHORISATION. Since target lists are often likely to be related to each other, such as battalion and brigade-nominated lists with division lists, the model includes the CANDIDATE-TARGET-LIST-ASSOCIATION. A similar provision is made for relating individual targets, for example, the elements of a complex target such as a military airbase, a major logistics facility, or a naval port, through the entity CANDIDATE-TARGET-DETAIL-ASSOCIATION. The structure is illustrated in Figure 27. ",
  "3.15.8.3 CANDIDATE-TARGET-LIST structure can be used to create prioritised lists of individually identified candidates. For example, Division A could nominate an enemy brigade for attack, a radar site for intercept activity, and an area in which friendly fire is to be avoided because a long-range reconnaissance patrol may be occupying it. The same structure can also be used to create targeting objectives by classes that may reflect the commander’s intent: for example—in order of priority—commandand-control centres, armoured fighting vehicles, POL supplies, and fire-control radars. Target lists can also be nested. The image depicts a data model or entity-relationship diagram related to \"Candidate Target List\" and its associated details. Here is the extracted caption information:\n\n- **CANDIDATE-TARGET-LIST**: \n  - Consists of / makes up: CANDIDATE-TARGET-DETAIL\n  - Is-the-subject-of / Is-the-object-of: CANDIDATE-TARGET-LIST-ASSOCIATION\n  - Is-assigned / Is-the-approval-for: CANDIDATE-TARGET-LIST-AUTHORISATION\n\n- **CANDIDATE-TARGET-DETAIL**:\n  - Candidate-target-detail-category-code\n  - Is-assigned / Is-the-approval-for: CANDIDATE-TARGET-DETAIL-AUTHORISATION\n  - Is-the-subject-of / Is-the-object-of: CANDIDATE-TARGET-DETAIL-ASSOCIATION\n  - Contains: CANDIDATE-TARGET-DETAIL-ITEM, CANDIDATE-TARGET-DETAIL-TYPE\n\n- **Associations**:\n  - CANDIDATE-TARGET-LIST-ASSOCIATION\n  - CANDIDATE-TARGET-LIST-AUTHORISATION\n  - CANDIDATE-TARGET-DETAIL-ASSOCIATION\n  - CANDIDATE-TARGET-DETAIL-AUTHORISATION\n\nThis diagram illustrates the relationships and authorizations between candidate target lists, their details, and associated items/types.3.15.8.4 Candidate target lists and individual candidate targets can be linked to the ACTION structure as illustrated in Figure 28. The connection can be at the list level or for individual item or type that is nominated for consideration in the operational planning process. 3.15.9 Locating ACTION Directly 3.15.9.1 An instance of ACTION is normally located indirectly by specifying the location of an instance of ACTION-RESOURCE-ITEM or ACTION-OBJECTIVEITEM or both. However, a requirement exists to locate an activity without recourse to either resource or objective or both. The primary uses are in (a) stating broad mission-level requirements in plans and orders and (b) locating instances of ACTION-EVENTs. ",
  "A diagram illustrating the relationships between various entities related to actions, objectives, tasks, and candidate targets. The entities include ACTION, ACTION-OBJECTIVE, ACTION-TASK, CANDIDATE-TARGET-LIST, ACTION-OBJECTIVE-ITEM, CANDIDATE-TARGET-DETAIL, ACTION-OBJECTIVE-TYPE, CANDIDATE-TARGET-DETAIL-ITEM, and CANDIDATE-TARGET-DETAIL-TYPE. Relationships such as \"is-focussed-on,\" \"may-be-used-in-planning,\" \"consists-of,\" \"may-be-specified-as,\" and category codes are depicted to show how these entities interact and are categorized.3.15.9.2 Mission-type planning may entail embodiment of commander’s intent in outlining schemes of manoeuvre or defensive postures that are to be prepared. The statements at the high level may be simply that a friendly formation is to block here, execute a supporting attack there, and concentrate the main attack here. These are examples of general activity statements from which the detailed statements will be developed. If the entire plan is thought of in hierarchical terms of actions and sub-actions, these activities would be near the root of the hierarchy. Standards, such as APP-6(A), support symbology for activities of the kind cited. The ability to situate task graphics for display independently of the location of resources or objectives is an operational requirement. 3.15.9.3 Event reporting may also be accomplished simply by being able to give the location of the event. For example, I see enemy tanks moving at Point $P l$ or $I$ see enemy activity in Area A2. There may nothing of particular interest at P1 or A2 that could serve as a suitable reference to establish a location. The report basically describes an activity at some location citing a type of object as a resource. A type object cannot be located directly within the constraints of the data specification and it should not be necessary to create an instance of an artificial item simply to serve as a reference for location. Similar situation may occur in the civil sector in reporting drive-by shootings, eruptions of riots, and pools of flooding. In some cases, such as flooding, there is neither a resource nor an objective. 3.15.9.4 The data specification includes an associative entity ACTIONLOCATION that enables geolocating an instance of ACTION directly without necessarily relying on the location of a resource or an objective. ",
  "3.15.10 Context for an ACTION 3.15.10.1 CONTEXT structure enables the specification of related data of the type that is referred to as an operational overlay. The planner can use the CONTEXT information to judge the merits of a plan or an order, and to assess a need for changes. Broader view of CONTEXT is discussed in a subsequent section. 3.15.10.2 ACTION-CONTEXT links ACTION to CONTEXT. In general, CONTEXT helps to set the whole situation, background, or environment relevant to a particular ACTION. It can specify conditions that must precede an ACTION or those that should result from the execution of an ACTION. It can also be used to impose additional constraints on ACTIONs and to preserve a historical sequence of snapshots of the actual execution of plans. 3.16 Data about Reported Data 3.16.1 Introduction 3.16.1.1 Considerable amount of information about situation in an operational arena consists of reports by persons or organisations. These generally refer to dynamic data, such as location, status, holdings, associations, and classification, regardless of whether the information refers to friendly, neutral, or hostile elements. It is also important to know for each estimate or report its validity, source, effective starting or ending times, and reporting time. The model captures the substantive information in numerous entities and the amplifying information in REPORTING-DATA and its subtypes. 3.16.1.2 Amplifying information enables a staff officer to compare different reports and make a sensible interpretation of the data. It also allows the staff officer to enter his own perception of reality based upon the raw data; this may be particularly applicable to an intelligence function that produces correlated information at a higher quality level. 3.16.1.3 REPORTING-DATA permits a mechanism for maintaining a historical record that applies not only to the past and present, but also to the future. Thus, it is just as easy to record that the required stockage level of an ammunition stock should be 10,000 three days from now as it is to record that the reported stockage level yesterday was 8,200. 3.16.2 REPORTING-DATA Structure 3.16.2.1 REPORTING-DATA is defined as the specification of source, quality and timing that applies to reported data. Its structure is illustrated in Figure 29. It has a mandatory relationship to ORGANISATION whose role is that of a reporting agent. Its two subtypes serve to specify timing information. 3.16.2.2 Ability to cite sources of information that are external to the data structures is useful. The sources could be ADatP-3 messages, printouts of electronic mail, memoranda of telephone conversations, and other physical storage means that need to be consulted. REFERENCE provides this functionality. REFERENCE pointers can be associated with one or more instances of REPORTING-DATA in order to amplify the data that is referred to by REPORTING-DATA. ",
  "The image depicts a data model or conceptual schema related to reporting processes. Here are the extracted captions:\n\n- **REPORTING-DATA**\n- **REFERENCE**\n- **reporting-data-timing-category-code**\n- **REPORTING-DATA-ABSOLUTE-TIMING**\n- **REPORTING-DATA-RELATIVE-TIMING**\n- **ACTION**\n- **action-category-code**\n- **ACTION-TASK**\n- **OBJECT-ITEM**\n- **object-item-category-code**\n- **ORGANISATION**\n\n### Relationships:\n- **provides-information-related-to / is-amplified-by**\n- **serves-as-timing-reference-for / uses-as-timing-reference**\n- **is-the-reporting-agent-for / is-reported-by**\n\nThis schema illustrates how various entities (like Reporting Data, Action, Object Item, and Organisation) interact with each other through defined relationships, emphasizing timing, categories, and reporting roles.3.16.3 Specifying Time 3.16.3.1 Time points and time periods need to be specified; for example, the starting time of an action, the reporting time of a situation report, and the period of time covered by a weather forecast. Time may be fixed or relative: a. Fixed (absolute) with respect to the standard calendar (e.g., 120700Z Sep69) b. Relative with respect to an arbitrary origin that may be unspecified (e.g., $\\mathrm { D } { + } 3$ ). Absolute and relative time characteristics are captured in subtypes REPORTING-DATAABSOLUTE-TIMING and REPORTING-DATA-RELATIVE-TIMING. 3.16.3.2 REPORTING-DATA-ABSOLUTE-TIMING is defined as “A REPORTING-DATA that specifies effective datetime that is referenced to Universal Time.” The specified epoch can be in the past, the present, or the future. The date follows the Gregorian calendar and the 24-hour clock time is defined with respect to Universal Time. 3.16.3.3 Effective time can also be relative. REPORTING-DATA-RELATIVETIMING is defined as “A REPORTING-DATA that specifies effective timing that is referenced to a specific ACTION-TASK.” Relative timing makes operational sense only in relation to planned activities; consequently, the origin of the time scale is established in reference to an instance of ACTION-TASK. ",
  "3.17 Applying Security Classifications Security classification is applied to the entities shown in Figure 30. The data elements in SECURITY-CLASSIFICATION provided for classification level, classification policy, and an appropriate caveat if applicable. Security-Classification includes Context, Plan-Order-Header-Content, Component-Header-Content, Reference, and Network-Service.3.18 Citing External Information Sources 3.18.1 REFERENCE structure provides the ability to cite external sources of information. REFERENCE is defined as “An identification of a record of information.” The structure of REFERENCE and its relationships to ACTION, CAPABILITY, OBJECT-ITEM, OBJECT-TYPE, ORGANISATION, REPORTING-DATA, and itself is illustrated in Figure 31. 3.18.2 The information that instances of REFERENCE point to can be used to amplify or support the data in one or more instances of the associated entities. The entity REFERENCE-ASSOCIATION enables the recording of relationships between instances of REFERENCE. In addition, the entity ORGANISATION-REFERENCEASSOCIATION identifies the administrative role that any instance of databased ORGANISATION has with respect to an instance of REFERENCE. Note that the organisational roles internal to documents cited in REFERENCE are identified in one of the attributes of REFERENCE. 3.18.3 Examples of references include e-mail messages, transcripts of combat net radio report, facsimiles sent over a secure line, printed reports by UN commissions, NATO dictionaries, books on data modelling, and others. ",
  "A diagram illustrating the relationships and associations between various entities such as Reference, Action, Capability, Object-Type, Object-Item, Reporting-Data, Organisation, and their respective reference associations. The connections are defined by terms like \"applies-to,\" \"has-relevant-information-in,\" \"provides-information-related-to,\" \"is-amplified-by,\" \"is-the-reporting-agent-for,\" \"is-reported-by,\" and \"is-administered-by.\"3.19 CONTEXT as a Way of Grouping Data 3.20.1 Introduction 3.19.1.1 Data tends to be distributed in various tables throughout a database that is designed on relational principles. Even a single table may contain disparate elements of data. Operational needs strongly support the concept of “grouping” or “packaging” data in order to provide a coherent picture that is relevant to a given situation or circumstance. CONTEXT provides a mechanism for referring to one or more records in various tables and treating them as a single “context.” 3.19.1.2 CONTEXT may entail a collection of data that is relevant to the situation, background, or environment for a particular unit or activity. It can specify conditions that must precede an ACTION or those that should result from the execution of an ACTION. A planner can use the context information to judge the merits of an operational plan, and make changes in order to respond to a changing operational situation. A commander can use the context information to provide his assessment. CONTEXT can also be used to -record the history of an evolving operation, capture a situation as it existed at some time in the past or portray a situation as it is expected to exist at a future date. 3.19.1.3 Since a specific CONTEXT can represent the view of the current operational picture that is held by a particular unit, it can be shared with other units or organisations. The sharing need not be limited to the operational picture, but can apply to ",
  "JC3IEDM OVERVIEW – UK – DMWG 16 February 2007 Edition 3.1a any defined concept that can be encompassed within CONTEXT specifications. One of the possible applications of CONTEXT is to serve as the basis for exchange or distribution of information. 3.20.2 Basic CONTEXT Structure 3.19.2.1 The basic structure of CONTEXT consists of CONTEXT-ELEMENT and its status, CONTEXT-ASSOCIATION and its status, and a subtype OPERATIONALINFORMATION-GROUP (in brief, OIG). Figure 32 shows the structure that enables an instances of CONTEXT to be defined, amended, and managed. A diagram illustrating the relationships between various entities in a contextual information framework, including CONTEXT, CONTEXT-ASSOCIATION, CONTEXT-ELEMENT, OBJECT-ITEM, REPORTING-DATA, and ORGANISATION, along with their statuses and associations.3.19.2.2 Data that is to be associated with an instance of CONTEXT is identified through CONTEXT-ELEMENT. Data may be moved in or out of an instance of CONTEXT by indicating the particular instances of CONTEXT-ELEMENT that apply at any given time. The entity CONTEXT-ELEMENT-STATUS keeps track of the inclusion status and its timing. This technique preserves data integrity while allowing the data content to change for any instance of CONTEXT. 3.19.2.3 The entity CONTEXT-ASSOCIATION and its child entity to indicate status permit the linking of one instance of CONTEXT to another with the relationship defined by the value of the category code in the association. 3.19.2.4 OPERATIONAL-INFORMATION-GROUP is a specialised CONTEXT with defined categories of operational information. The concept of an operational information group was created in order to have sets of information that are subject to standard definition of their content, and represent the owning organisation’s view at a given time, such as the current friendly picture. Once an instance of an OPERATIONAL-INFORMATION-GROUP is created, it is to be maintained under the same identifier but the content of the instance is permitted to change over time. OPERATIONAL-INFORMATION-GROUP is used by applications to manage organisational views of data and to exchange them with other participants. ",
  "3.20.3 Relationship of CONTEXT to Other Entities CONTEXT is related to other entities as illustrated in Figure 33. The functionality that the associations provide is summarised as follows: The image depicts a conceptual model illustrating the relationships between various entities in an operational information framework. Key elements include:\n\n- **CONTEXT**: Linked to \"context-category-code\" and associated with \"OPERATIONAL-INFORMATION-GROUP\" through \"is-cited-by.\"\n- **OPERATIONAL-INFORMATION-GROUP**: Connected to \"OPERATIONAL-INFORMATION-GROUP-ORGANISATION-ASSOCIATION\" and \"CONTEXT-REPORTING-DATA-ASSOCIATION.\"\n- **REPORTING-DATA**: Associated with \"CONTEXT-REPORTING-DATA-ASSOCIATION\" and linked to \"ORGANISATION\" via reporting roles.\n- **OBJECT-ITEM**: Categorized by \"object-item-category-code\" and related to \"CONTEXT-OBJECT-ITEM-ASSOCIATION.\"\n- **ORGANISATION**: Establishes or is established by \"ACTION-CONTEXT-STATUS\" and has roles concerning \"REPORTING-DATA.\"\n- **ACTION-CONTEXT**: Provides circumstances for \"ACTION\" and is placed within the broader action framework.\n\nThe diagram uses directional arrows and labels like \"is-the-subject-of,\" \"has-a-role-with-respect-to,\" and \"establishes / is-established-by\" to define these relationships, forming a structured network of operational data associations.a. An instance of CONTEXT can be related to an instance of ACTION. This is an important linkage that (i) permits an ACTION to be made a part of a CONTEXT in defining Operational Information Groups and (ii) enables packages of information to be coupled to plans and orders making them a condition of plans or orders or amass related information, such as the trace of activity in time. b An instance of CONTEXT can be related to an instance of OBJECT-ITEM. This permits (i) a set of information to be associated with an instance of OBJECT-ITEM or (ii) make an instance of OBJECT-ITEM part of CONTEXT. ",
  "c. OPERATIONAL-INFORMATION-GROUP is a subtype of CONTEXT. It is an important concept that makes extensive use of CONTEXT and its relationships. The association with ORGANISATION aids in the management of OPERATIONAL-INFORMATION-GROUPs.   \nd. CONTEXT can support correlation of data where several elements of information are collected as part of the CONTEXT and can then be related to the “new” information that is derived from the “raw” data via CONTEXTREPORTING-DATA-ASSOCIATION. 3.19.4 CONTEXT-ASSESSMENT 3.19.4.1 The entity CONTEXT-ASSESSMENT provides an opportunity for an ORGANISATION to add to any instance of CONTEXT a limited amount of free-text information to convey information that cannot be represented in structured data. One of the possibilities is to give an overall appraisal of unit capability where CONTEXT collects the relevant elements of information, such as status, location, and holdings. Explanatory information can be added to plans and orders when an instance of CONTEXT with an assessment is linked to an instance of ACTION. Addition of text in CONTEXTASSESSMENT is optional, but if an assessment is added it becomes an integral part of the “context.” 3.19.4.2 The structure for CONTEXT-ASSESSMENT is illustrated in Figure 34. A diagram illustrating the relationships between \"CONTEXT,\" \"OBJECT-ITEM,\" \"CONTEXT-ASSESSMENT,\" and \"ORGANISATION.\" The \"CONTEXT\" identifies the data for \"CONTEXT-ASSESSMENT,\" which provides information to \"ORGANISATION.\" Additionally, \"OBJECT-ITEM\" is linked to \"ORGANISATION\" through an \"object-item-category-code.\"3.20 Attaching Affiliation to Items and Types 3.20.1 General Description 3.20.1.1 There is a need to identify, for various reasons, one or more associations according to country, nationality, ethnicity, or allegiance. It is quite conceivable to have a person of one nationality, associated with a country that is different from his nationality, and owing allegiance to yet another entity that may not even be a country. ",
  "3.20.1.2 The independent entity AFFILIATION has four subtypes that represent sets of values to enable the tagging of types or items. AFFILIATION has a non-identifying relationship to OBJECT-TYPE to set the persistent type characteristics. AFFILIATION is linked to OBJECT-ITEM to enable the specification of individual exceptions to the characterisation that an item inherits by association with a type. The structure is illustrated in Figure 35. A diagram illustrating the hierarchical structure of object affiliations, starting with \"OBJECT-TYPE\" and \"OBJECT-ITEM,\" which both lead to \"OBJECT-TYPE-AFFILIATION\" and \"OBJECT-ITEM-AFFILIATION,\" respectively. These then connect to \"AFFILIATION,\" which branches into categories such as \"AFFILIATION-ETHNIC-GROUP,\" \"AFFILIATION-FUNCTIONAL-GROUP,\" \"AFFILIATION-GEO-POLITICAL,\" and \"AFFILIATION-RELIGION,\" all under the overarching \"affiliation-category-code.\"3.20.2 Specification of AFFILIATION and Its Subtypes 3.20.2.1 An AFFILIATION is defined as “A specification of a country, nationality, ethnic group, functional group, exercise group, or religion to which membership or allegiance may be ascribed.” The subtype AFFILIATION-ETHNICGROUP provides a list of ethnic groups. AFFILIATION-FUNCTIONAL-GROUP specifies groups characterised by their primary purpose. It also has a name attribute that permits the entry of any ad hoc description within criminal, exercise, multinational, and terrorist categories. AFFILIATION-GEOPOLITICAL provides a list of countries or political entities. The list includes country or nationality codes that have been aligned with country code list in ISO 3166. AFFILIATION-RELIGION provides a list of religions. 3.20.2.2 AFFILIATION-FUNCTIONAL-GROUP enables the specification of groups as data since it is difficult to determine in advance all the potential functional groups, and it is equally indeterminate how many exercise countries or other objects may be needed. 3.20.3 AFFILIATION Relationships 3.20.3.1 An OBJECT-TYPE-AFFILIATION is defined as “A relationship between a specific OBJECT-TYPE and a specific AFFILIATION that identifies an inherent allegiance.” This entity is to be used routinely to assign a permanent normal or persistent affiliation to an instance of OBJECT-TYPE. Because each instance of OBJECTITEM must be associated with at least one instance of OBJECT-TYPE, the item inherits allegiance characteristics from the type. ",
  "3.20.3.2 An OBJECT-ITEM-AFFILIATION is defined as “A relationship between a specific OBJECT-ITEM and a specific AFFILIATION.” This entity is intended to record exceptions to affiliations identified in OBJECT-TYPE and may include the following cases: a. Affiliations that differ from the type affiliation that are inherited through OBJECTITEM-TYPE.   \nb. Serial affiliations that represent succession of affiliations over time.   \nc. Multiple affiliations that are valid at the same time. 3.21 Counting Persons by Group Characteristics 3.21.1 Introduction 3.21.1.1 Article V First Hostile Act and multiple CRO requirements point to a need to count PERSON-TYPEs grouped by one or more characteristics that in effect stratify or segment a given population. The data structure described in this section permits the counting of PERSON-TYPEs according to one or more characteristics. It enables the reporting of the number of killed and injured as the result of a bomb explosion or some other form of attack. It also satisfies a number of CRO requirements for accounting of refugee camp occupants. For example, one could express how many young girls from Kosovo are afflicted with diphtheria. Entity-Relationship Diagram illustrating the connections between various entities such as OBJECT-TYPE, PERSON-TYPE, OBJECT-ITEM, OBJECT-ITEM-GROUP-ACCOUNT, ACTION, OBJECT-ITEM-GROUP-ACCOUNT-DETAIL, and GROUP-CHARACTERISTIC, with relationships defined by phrases like \"has-an-associated,\" \"is-cited-in,\" \"is-enumerated-in,\" \"is-the-reason-for,\" and \"provides-categorisation-for.\"",
  "3.21.2 Description of Counting Structure 3.21.2.1 The structure is made up of two principal parts. The first consists of the entity OBJECT-ITEM-GROUP-ACCOUNT and its child OBJECT-ITEM-GROUPACCOUNT-DETAIL. These entities permit as many groupings to be accounted for as is necessary for an instance of OBJECT-ITEM at a specified time. The actual count is specified in OBJECT-ITEM-GROUP-ACCOUNT-DETAIL together with an attribute that further qualifies the count to account for morbidity and other states that the counted group may occupy. The count could be for a refugee camp, hospital, POW camp, or another facility; an organisation; a geographic location; a control feature; or even a meteorolgic feature, such as an area affected by a tornado. The second part is the GROUPCHARACTERISTIC entity. It permits as many factors to be entered as needed simultaneously in order to capture the required stratification. Thus, we could be talking about the number of Algerian adult females who happen to be Catholic and are infected by smallpox and are triaged as T4. 3.21.2.2 The current design permits group counting only for instances of PERSON-TYPE that are identified through a mandatory non-identifying relationship from PERSON-TYPE to OBJECT-ITEM-GROUP-ACCOUNT-DETAIL. The limitation is due to the set of operational requirements that pointed only to types of persons. The structure can be generalised to encompass OBJECT-TYPE or additional structure could be added to accommodate likely counting possibilities for other types, such as MATERIEL-TYPE. 3.21.2.3 The characteristics that apply to any particular group that is to be counted may be drawn from the native attributes of the entities OBJECT-TYPE, PERSON-TYPE, and GROUP-CHARACTERISTIC. The relationship between GROUPCHARACTERISTIC and OBJECT-ITEM-GROUP-ACCOUNT-DETAIL has been made optional to permit cases where the grouping inherent in the definition of PERSON-TYPE (that necessarily includes OBJECT-TYPE) provides an adequate set of discriminators for the desired count. 3.21.2.4 The underlying cause or causes for the reported counting must be specified through the ACTION structure. The specific link is the optional non-identifying relationship from ACTION to OBJECT-ITEM-ACCOUNT. The ACTION structure enables the identification of the agent (ACTION-RESOURCE) and the “target” (ACTION-OBJECTIVE) as appropriate. 3.21.3 Specification of Counting Structure 3.21.3.1 A GROUP-CHARACTERISTIC is defined as “A reference to a set of characteristics that may be used for identifying a distinct collection of objects.” The characteristics that can be selected are age group, gender, malady type, malady transmissibility indicator, language, and triage code. 13.21.3.2 An OBJECT-ITEM-GROUP-ACCOUNT is defined as “A reference to accounting for a set of groups that are associated with the specific OBJECT-ITEM at the time specified by REPORTING-DATA.” The accounting may result from or be affected by a specific ACTION. 13.21.3.3 An OBJECT-ITEM-GROUP-ACCOUNT-DETAIL is defined as “The total count and condition of a specific group included in a specific OBJECT-ITEM",
  "GROUP-ACCOUNT. The group is defined as a specific PERSON-TYPE that may also be categorised by a specific GROUP-CHARACTERISTIC.” The key attributes account for the number in a group and a qualifier that adds descriptors such as ailing; captured; deserted; killed; or missing. 3.22 Summary of JC3IEDM Features 3.22.1 An overview of the data model is presented in Figure 37. The fifteen main entities are shaded in grey. The grouping of entities is instructive in itself. The bottom part of the diagram centred about OBJECT-TYPE, OBJECT-ITEM, and LOCATION is intended to support situational awareness: what is out there, what does it have, what it is supposed to have, where is it, what is its status, what are its relationships with other objects. 3.22.2 Upper part is focused on ACTION with CAPABILITY, CONTEXT, and RULE-OF-ENGAGEMENT being oriented primarily to ACTION. Much of this data tends to be dynamic in nature: what are the objects capable of and how are they to be used, how are they being used, and what are they achieving. A diagram illustrating a complex network of interconnected concepts and entities, including \"PLAN-ORDER,\" \"ACTION,\" \"OBJECT-TYPE,\" \"CONTEXT,\" and \"SECURITY-CLASSIFICATION.\" The relationships between these elements are depicted through various connecting lines, showcasing a structured framework for organizing and understanding operational or strategic planning components.",
  "3.22.3 REPORTING-DATA plays a special role in the model. It records reporting data about much of the information held in the lower part of the model. It also serves as the means for that information to be used in multiple ways in developing courses of action, allocating resources, preparing plans, and executing operations orders, all of which are in the province of the upper part of the model. 3.22.4 The upper and the lower parts are connected through a number of associative entities that are used for linking plans, orders, and requests through objectives, resources, and effects to OBJECT-TYPEs and OBJECT-ITEMs. 3.22.5 An example to illustrate the use of the data structures follows. 3.23 Examples of Potential Use 3.23.1 Plans and Orders A plan may be structured in a five-paragraph format using the PLAN-ORDER structure. Part of its content may be provided by ACTION specifications, as discussed below. 3.23.2 Supporting PLAN-ORDER via ACTION The steps in developing the ACTION specifications to support a PLAN-ORDER: may include the following: a. Create a new ACTION-TASK or specify new parameters for an existing ACTION in order to take the initiative or to respond to an ACTION-EVENT.   \nb. Add detail to the ACTION-TASK by using the functional and temporal associations. This permits the subdivision of the plan into sub-activities with differing functional and temporal relationships to the high-level plan.   \nc. Identify the ACTION-OBJECTIVEs in terms of OBJECT-TYPEs and/or OBJECTITEMs. This is the mechanism for identifying key objectives in terms of enemy units, facilities, and materiel (e.g., destroy a bridge in enemy held territory).   \nd. Search for the required CAPABILITYs to perform the ACTION. This is the process of matching the appropriate ACTION-RESOURCE to meet the requirements of a specific ACTION. For example, crossing of an obstacle requires the employment of an engineer UNIT-TYPE with the appropriate CAPABILITY, and the movement of personnel requires vehicles or aircraft with the appropriate payloads.   \ne. Allocate OBJECT-TYPE as an ACTION-RESOURCE to an ACTION-TASK based on its CAPABILITY-NORM. Having identified the requirement for troop-carrying vehicles, this step requires the allocation of, for example, 12 Blackhawk helicopters.   \nf. In order to determine what resources are available for this ACTION, search for OBJECT-ITEMs whose OBJECT-ITEM-CAPABILITY matches the CAPABILITYNORM for their type. For example, the 3rd US Aviation Brigade may have 24 Blackhawk helicopters and the 1st US Marine Expeditionary Force may have 12.   \ng. Allocate individual OBJECT-ITEMs as ACTION-RESOURCEs to an ACTIONTASK. Twelve Blackhawk helicopters from the 3rd US Aviation Brigade are designated to perform the task. ",
  "h. Define CONTROL-FEATUREs to support the ACTION. Such features may be air corridors, low-level transit routes, or target areas. 3.23.3 Reporting of Status Status reporting deals with a wide range of objects, from an individual soldier to a complete situation report. The entities used to generate such reports encompass most of the data model. The following is a sample of possible applications: a. The OBJECT-ITEM-STATUS entity can be used to record information about individual OBJECT-ITEMs (e.g., Sgt. T. Hanks is wounded in action; 15 (GE) Panzer Division is fully operational).   \nb. ACTION-TASK-STATUS may be used to provide updates on the dynamics of the situation (e.g., minefield laying 70 percent complete, estimated time of completion $^ +$ 2 hours).   \nc. ACTION-EVENT-STATUS provides a means of reporting unplanned activity (e.g., flooding started in New Orleans at 1626 on 7 September 2005).   \nd. OBJECT-ITEM associations can be used to specify a friendly/enemy order of battle (in particular, OBJECT-ITEM-ASSOCIATION).   \ne. Establishments and HOLDING can be used to indicate surpluses or deficiencies (e.g., 1 (DA) Mechanised Brigade has a holding of 50 Leopard I main battle tanks whereas it is established to have 56). "
]